Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x276 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x43a7d): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5ffdd): ../Core/Src/fonts.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x57efb): C:/Users/aybuke.sokmen/Desktop/CANTEK-FARMINOVA/1-PROJELER/1-Git/Experiments/AIRSENSE/Software/yeni/software/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x42d66): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x27168): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x1b15d): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x63c26): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x6d8ce): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x2bc94): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0xb9f4): long int
 <1><64>: Abbrev Number: 2 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 7	(unsigned)
    <67>   DW_AT_name        : (indirect string, offset: 0x1f845): long unsigned int
 <1><6b>: Abbrev Number: 2 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 8
    <6d>   DW_AT_encoding    : 5	(signed)
    <6e>   DW_AT_name        : (indirect string, offset: 0x3d38d): long long int
 <1><72>: Abbrev Number: 2 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 8
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x1baaf): long long unsigned int
 <1><79>: Abbrev Number: 4 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : int
 <1><80>: Abbrev Number: 2 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 4
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : (indirect string, offset: 0xb3a2): unsigned int
 <1><87>: Abbrev Number: 3 (DW_TAG_typedef)
    <88>   DW_AT_name        : (indirect string, offset: 0x2716a): uint8_t
    <8c>   DW_AT_decl_file   : 3
    <8d>   DW_AT_decl_line   : 24
    <8e>   DW_AT_decl_column : 19
    <8f>   DW_AT_type        : <0x30>
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x6d8d0): uint16_t
    <98>   DW_AT_decl_file   : 3
    <99>   DW_AT_decl_line   : 36
    <9a>   DW_AT_decl_column : 20
    <9b>   DW_AT_type        : <0x4a>
 <1><9f>: Abbrev Number: 5 (DW_TAG_const_type)
    <a0>   DW_AT_type        : <0x93>
 <1><a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0x7c0c0): size_t
    <a9>   DW_AT_decl_file   : 4
    <aa>   DW_AT_decl_line   : 209
    <ab>   DW_AT_decl_column : 23
    <ac>   DW_AT_type        : <0x80>
 <1><b0>: Abbrev Number: 2 (DW_TAG_base_type)
    <b1>   DW_AT_byte_size   : 8
    <b2>   DW_AT_encoding    : 4	(float)
    <b3>   DW_AT_name        : (indirect string, offset: 0xcbc8): long double
 <1><b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b8>   DW_AT_byte_size   : 4
    <b9>   DW_AT_type        : <0xbd>
 <1><bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <be>   DW_AT_byte_size   : 1
    <bf>   DW_AT_encoding    : 8	(unsigned char)
    <c0>   DW_AT_name        : (indirect string, offset: 0x42d6d): char
 <1><c4>: Abbrev Number: 5 (DW_TAG_const_type)
    <c5>   DW_AT_type        : <0xbd>
 <1><c9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ca>   DW_AT_byte_size   : 4
    <cb>   DW_AT_type        : <0xc4>
 <1><cf>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d0>   DW_AT_byte_size   : 8
    <d1>   DW_AT_decl_file   : 5
    <d2>   DW_AT_decl_line   : 53
    <d3>   DW_AT_decl_column : 9
    <d4>   DW_AT_sibling     : <0x100>
 <2><d8>: Abbrev Number: 8 (DW_TAG_member)
    <d9>   DW_AT_name        : (indirect string, offset: 0x1a4e4): FontWidth
    <dd>   DW_AT_decl_file   : 5
    <de>   DW_AT_decl_line   : 54
    <df>   DW_AT_decl_column : 10
    <e0>   DW_AT_type        : <0x87>
    <e4>   DW_AT_data_member_location: 0
 <2><e5>: Abbrev Number: 8 (DW_TAG_member)
    <e6>   DW_AT_name        : (indirect string, offset: 0x9f86): FontHeight
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 55
    <ec>   DW_AT_decl_column : 10
    <ed>   DW_AT_type        : <0x87>
    <f1>   DW_AT_data_member_location: 1
 <2><f2>: Abbrev Number: 8 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0x3e7dc): data
    <f7>   DW_AT_decl_file   : 5
    <f8>   DW_AT_decl_line   : 56
    <f9>   DW_AT_decl_column : 18
    <fa>   DW_AT_type        : <0x100>
    <fe>   DW_AT_data_member_location: 4
 <2><ff>: Abbrev Number: 0
 <1><100>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <101>   DW_AT_byte_size   : 4
    <102>   DW_AT_type        : <0x9f>
 <1><106>: Abbrev Number: 3 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xfe03): FontDef_t
    <10b>   DW_AT_decl_file   : 5
    <10c>   DW_AT_decl_line   : 57
    <10d>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xcf>
 <1><112>: Abbrev Number: 7 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 4
    <114>   DW_AT_decl_file   : 5
    <115>   DW_AT_decl_line   : 62
    <116>   DW_AT_decl_column : 9
    <117>   DW_AT_sibling     : <0x136>
 <2><11b>: Abbrev Number: 8 (DW_TAG_member)
    <11c>   DW_AT_name        : (indirect string, offset: 0x88e02): Length
    <120>   DW_AT_decl_file   : 5
    <121>   DW_AT_decl_line   : 63
    <122>   DW_AT_decl_column : 11
    <123>   DW_AT_type        : <0x93>
    <127>   DW_AT_data_member_location: 0
 <2><128>: Abbrev Number: 8 (DW_TAG_member)
    <129>   DW_AT_name        : (indirect string, offset: 0x9f8a): Height
    <12d>   DW_AT_decl_file   : 5
    <12e>   DW_AT_decl_line   : 64
    <12f>   DW_AT_decl_column : 11
    <130>   DW_AT_type        : <0x93>
    <134>   DW_AT_data_member_location: 2
 <2><135>: Abbrev Number: 0
 <1><136>: Abbrev Number: 3 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0x84798): FONTS_SIZE_t
    <13b>   DW_AT_decl_file   : 5
    <13c>   DW_AT_decl_line   : 65
    <13d>   DW_AT_decl_column : 3
    <13e>   DW_AT_type        : <0x112>
 <1><142>: Abbrev Number: 9 (DW_TAG_variable)
    <143>   DW_AT_name        : (indirect string, offset: 0x16708): Font_7x10
    <147>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 80
    <149>   DW_AT_decl_column : 18
    <14a>   DW_AT_type        : <0x106>
    <14e>   DW_AT_external    : 1
    <14e>   DW_AT_declaration : 1
 <1><14e>: Abbrev Number: 9 (DW_TAG_variable)
    <14f>   DW_AT_name        : (indirect string, offset: 0x3c55a): Font_11x18
    <153>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 85
    <155>   DW_AT_decl_column : 18
    <156>   DW_AT_type        : <0x106>
    <15a>   DW_AT_external    : 1
    <15a>   DW_AT_declaration : 1
 <1><15a>: Abbrev Number: 9 (DW_TAG_variable)
    <15b>   DW_AT_name        : (indirect string, offset: 0x316da): Font_16x26
    <15f>   DW_AT_decl_file   : 5
    <160>   DW_AT_decl_line   : 90
    <161>   DW_AT_decl_column : 18
    <162>   DW_AT_type        : <0x106>
    <166>   DW_AT_external    : 1
    <166>   DW_AT_declaration : 1
 <1><166>: Abbrev Number: 10 (DW_TAG_array_type)
    <167>   DW_AT_type        : <0x9f>
    <16b>   DW_AT_sibling     : <0x177>
 <2><16f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <170>   DW_AT_type        : <0x80>
    <174>   DW_AT_upper_bound : 949
 <2><176>: Abbrev Number: 0
 <1><177>: Abbrev Number: 5 (DW_TAG_const_type)
    <178>   DW_AT_type        : <0x166>
 <1><17c>: Abbrev Number: 12 (DW_TAG_variable)
    <17d>   DW_AT_name        : (indirect string, offset: 0x69fda): Font7x10
    <181>   DW_AT_decl_file   : 1
    <182>   DW_AT_decl_line   : 21
    <183>   DW_AT_decl_column : 16
    <184>   DW_AT_type        : <0x177>
    <188>   DW_AT_external    : 1
    <188>   DW_AT_location    : 5 byte block: 3 20 32 0 8 	(DW_OP_addr: 8003220)
 <1><18e>: Abbrev Number: 10 (DW_TAG_array_type)
    <18f>   DW_AT_type        : <0x9f>
    <193>   DW_AT_sibling     : <0x19f>
 <2><197>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <198>   DW_AT_type        : <0x80>
    <19c>   DW_AT_upper_bound : 1709
 <2><19e>: Abbrev Number: 0
 <1><19f>: Abbrev Number: 5 (DW_TAG_const_type)
    <1a0>   DW_AT_type        : <0x18e>
 <1><1a4>: Abbrev Number: 12 (DW_TAG_variable)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x2ce62): Font11x18
    <1a9>   DW_AT_decl_file   : 1
    <1aa>   DW_AT_decl_line   : 119
    <1ab>   DW_AT_decl_column : 16
    <1ac>   DW_AT_type        : <0x19f>
    <1b0>   DW_AT_external    : 1
    <1b0>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1b6>: Abbrev Number: 10 (DW_TAG_array_type)
    <1b7>   DW_AT_type        : <0x9f>
    <1bb>   DW_AT_sibling     : <0x1c7>
 <2><1bf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1c0>   DW_AT_type        : <0x80>
    <1c4>   DW_AT_upper_bound : 2469
 <2><1c6>: Abbrev Number: 0
 <1><1c7>: Abbrev Number: 5 (DW_TAG_const_type)
    <1c8>   DW_AT_type        : <0x1b6>
 <1><1cc>: Abbrev Number: 12 (DW_TAG_variable)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x221cb): Font16x26
    <1d1>   DW_AT_decl_file   : 1
    <1d2>   DW_AT_decl_line   : 217
    <1d3>   DW_AT_decl_column : 16
    <1d4>   DW_AT_type        : <0x1c7>
    <1d8>   DW_AT_external    : 1
    <1d8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1de>: Abbrev Number: 13 (DW_TAG_variable)
    <1df>   DW_AT_specification: <0x142>
    <1e3>   DW_AT_decl_file   : 1
    <1e4>   DW_AT_decl_line   : 316
    <1e6>   DW_AT_decl_column : 11
    <1e7>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><1ed>: Abbrev Number: 13 (DW_TAG_variable)
    <1ee>   DW_AT_specification: <0x14e>
    <1f2>   DW_AT_decl_file   : 1
    <1f3>   DW_AT_decl_line   : 322
    <1f5>   DW_AT_decl_column : 11
    <1f6>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1fc>: Abbrev Number: 13 (DW_TAG_variable)
    <1fd>   DW_AT_specification: <0x15a>
    <201>   DW_AT_decl_file   : 1
    <202>   DW_AT_decl_line   : 328
    <204>   DW_AT_decl_column : 11
    <205>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><20b>: Abbrev Number: 14 (DW_TAG_subprogram)
    <20c>   DW_AT_external    : 1
    <20c>   DW_AT_name        : (indirect string, offset: 0x2da55): strlen
    <210>   DW_AT_decl_file   : 6
    <211>   DW_AT_decl_line   : 41
    <212>   DW_AT_decl_column : 9
    <213>   DW_AT_prototyped  : 1
    <213>   DW_AT_type        : <0xa4>
    <217>   DW_AT_declaration : 1
    <217>   DW_AT_sibling     : <0x221>
 <2><21b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <21c>   DW_AT_type        : <0xc9>
 <2><220>: Abbrev Number: 0
 <1><221>: Abbrev Number: 16 (DW_TAG_subprogram)
    <222>   DW_AT_external    : 1
    <222>   DW_AT_name        : (indirect string, offset: 0x74675): FONTS_GetStringSize
    <226>   DW_AT_decl_file   : 1
    <227>   DW_AT_decl_line   : 334
    <229>   DW_AT_decl_column : 7
    <22a>   DW_AT_prototyped  : 1
    <22a>   DW_AT_type        : <0xb7>
    <22e>   DW_AT_low_pc      : 0x0
    <232>   DW_AT_high_pc     : 0x3a
    <236>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <238>   DW_AT_GNU_all_tail_call_sites: 1
    <238>   DW_AT_sibling     : <0x26d>
 <2><23c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <23d>   DW_AT_name        : str
    <241>   DW_AT_decl_file   : 1
    <242>   DW_AT_decl_line   : 334
    <244>   DW_AT_decl_column : 33
    <245>   DW_AT_type        : <0xb7>
    <249>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><24c>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <24d>   DW_AT_name        : (indirect string, offset: 0x3fdd8): SizeStruct
    <251>   DW_AT_decl_file   : 1
    <252>   DW_AT_decl_line   : 334
    <254>   DW_AT_decl_column : 52
    <255>   DW_AT_type        : <0x26d>
    <259>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><25c>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <25d>   DW_AT_name        : (indirect string, offset: 0x72e90): Font
    <261>   DW_AT_decl_file   : 1
    <262>   DW_AT_decl_line   : 334
    <264>   DW_AT_decl_column : 75
    <265>   DW_AT_type        : <0x273>
    <269>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><26c>: Abbrev Number: 0
 <1><26d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26e>   DW_AT_byte_size   : 4
    <26f>   DW_AT_type        : <0x136>
 <1><273>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <274>   DW_AT_byte_size   : 4
    <275>   DW_AT_type        : <0x106>
 <1><279>: Abbrev Number: 0
  Compilation Unit @ offset 0x27a:
   Length:        0x1593 (32-bit)
   Version:       4
   Abbrev Offset: 0x111
   Pointer Size:  4
 <0><285>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <286>   DW_AT_producer    : (indirect string, offset: 0x43a7d): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <28a>   DW_AT_language    : 12	(ANSI C99)
    <28b>   DW_AT_name        : (indirect string, offset: 0x86b7d): ../Core/Src/main.c
    <28f>   DW_AT_comp_dir    : (indirect string, offset: 0x57efb): C:/Users/aybuke.sokmen/Desktop/CANTEK-FARMINOVA/1-PROJELER/1-Git/Experiments/AIRSENSE/Software/yeni/software/Debug
    <293>   DW_AT_ranges      : 0x10
    <297>   DW_AT_low_pc      : 0x0
    <29b>   DW_AT_stmt_list   : 0x7d4
    <29f>   DW_AT_GNU_macros  : 0x160c9
 <1><2a3>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a4>   DW_AT_byte_size   : 1
    <2a5>   DW_AT_encoding    : 6	(signed char)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x42d66): signed char
 <1><2aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x27168): __uint8_t
    <2af>   DW_AT_decl_file   : 3
    <2b0>   DW_AT_decl_line   : 43
    <2b1>   DW_AT_decl_column : 24
    <2b2>   DW_AT_type        : <0x2b6>
 <1><2b6>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b7>   DW_AT_byte_size   : 1
    <2b8>   DW_AT_encoding    : 8	(unsigned char)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x1b15d): unsigned char
 <1><2bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <2be>   DW_AT_byte_size   : 2
    <2bf>   DW_AT_encoding    : 5	(signed)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x63c26): short int
 <1><2c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x6d8ce): __uint16_t
    <2c9>   DW_AT_decl_file   : 3
    <2ca>   DW_AT_decl_line   : 57
    <2cb>   DW_AT_decl_column : 25
    <2cc>   DW_AT_type        : <0x2d0>
 <1><2d0>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d1>   DW_AT_byte_size   : 2
    <2d2>   DW_AT_encoding    : 7	(unsigned)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x2bc94): short unsigned int
 <1><2d7>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d8>   DW_AT_byte_size   : 4
    <2d9>   DW_AT_encoding    : 5	(signed)
    <2da>   DW_AT_name        : (indirect string, offset: 0xb9f4): long int
 <1><2de>: Abbrev Number: 3 (DW_TAG_typedef)
    <2df>   DW_AT_name        : (indirect string, offset: 0x86718): __uint32_t
    <2e3>   DW_AT_decl_file   : 3
    <2e4>   DW_AT_decl_line   : 79
    <2e5>   DW_AT_decl_column : 25
    <2e6>   DW_AT_type        : <0x2ea>
 <1><2ea>: Abbrev Number: 2 (DW_TAG_base_type)
    <2eb>   DW_AT_byte_size   : 4
    <2ec>   DW_AT_encoding    : 7	(unsigned)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1f845): long unsigned int
 <1><2f1>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f2>   DW_AT_byte_size   : 8
    <2f3>   DW_AT_encoding    : 5	(signed)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x3d38d): long long int
 <1><2f8>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f9>   DW_AT_byte_size   : 8
    <2fa>   DW_AT_encoding    : 7	(unsigned)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x1baaf): long long unsigned int
 <1><2ff>: Abbrev Number: 4 (DW_TAG_base_type)
    <300>   DW_AT_byte_size   : 4
    <301>   DW_AT_encoding    : 5	(signed)
    <302>   DW_AT_name        : int
 <1><306>: Abbrev Number: 2 (DW_TAG_base_type)
    <307>   DW_AT_byte_size   : 4
    <308>   DW_AT_encoding    : 7	(unsigned)
    <309>   DW_AT_name        : (indirect string, offset: 0xb3a2): unsigned int
 <1><30d>: Abbrev Number: 3 (DW_TAG_typedef)
    <30e>   DW_AT_name        : (indirect string, offset: 0x2716a): uint8_t
    <312>   DW_AT_decl_file   : 4
    <313>   DW_AT_decl_line   : 24
    <314>   DW_AT_decl_column : 19
    <315>   DW_AT_type        : <0x2aa>
 <1><319>: Abbrev Number: 3 (DW_TAG_typedef)
    <31a>   DW_AT_name        : (indirect string, offset: 0x6d8d0): uint16_t
    <31e>   DW_AT_decl_file   : 4
    <31f>   DW_AT_decl_line   : 36
    <320>   DW_AT_decl_column : 20
    <321>   DW_AT_type        : <0x2c4>
 <1><325>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <326>   DW_AT_type        : <0x319>
 <1><32a>: Abbrev Number: 6 (DW_TAG_const_type)
    <32b>   DW_AT_type        : <0x319>
 <1><32f>: Abbrev Number: 3 (DW_TAG_typedef)
    <330>   DW_AT_name        : (indirect string, offset: 0x8671a): uint32_t
    <334>   DW_AT_decl_file   : 4
    <335>   DW_AT_decl_line   : 48
    <336>   DW_AT_decl_column : 20
    <337>   DW_AT_type        : <0x2de>
 <1><33b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <33c>   DW_AT_type        : <0x32f>
 <1><340>: Abbrev Number: 7 (DW_TAG_structure_type)
    <341>   DW_AT_byte_size   : 16
    <342>   DW_AT_decl_file   : 5
    <343>   DW_AT_decl_line   : 291
    <345>   DW_AT_decl_column : 9
    <346>   DW_AT_sibling     : <0x383>
 <2><34a>: Abbrev Number: 8 (DW_TAG_member)
    <34b>   DW_AT_name        : CCR
    <34f>   DW_AT_decl_file   : 5
    <350>   DW_AT_decl_line   : 293
    <352>   DW_AT_decl_column : 17
    <353>   DW_AT_type        : <0x33b>
    <357>   DW_AT_data_member_location: 0
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0x862e3): CNDTR
    <35d>   DW_AT_decl_file   : 5
    <35e>   DW_AT_decl_line   : 294
    <360>   DW_AT_decl_column : 17
    <361>   DW_AT_type        : <0x33b>
    <365>   DW_AT_data_member_location: 4
 <2><366>: Abbrev Number: 9 (DW_TAG_member)
    <367>   DW_AT_name        : (indirect string, offset: 0x86c73): CPAR
    <36b>   DW_AT_decl_file   : 5
    <36c>   DW_AT_decl_line   : 295
    <36e>   DW_AT_decl_column : 17
    <36f>   DW_AT_type        : <0x33b>
    <373>   DW_AT_data_member_location: 8
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x86589): CMAR
    <379>   DW_AT_decl_file   : 5
    <37a>   DW_AT_decl_line   : 296
    <37c>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x33b>
    <381>   DW_AT_data_member_location: 12
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 10 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x86a5a): DMA_Channel_TypeDef
    <388>   DW_AT_decl_file   : 5
    <389>   DW_AT_decl_line   : 297
    <38b>   DW_AT_decl_column : 3
    <38c>   DW_AT_type        : <0x340>
 <1><390>: Abbrev Number: 7 (DW_TAG_structure_type)
    <391>   DW_AT_byte_size   : 8
    <392>   DW_AT_decl_file   : 5
    <393>   DW_AT_decl_line   : 299
    <395>   DW_AT_decl_column : 9
    <396>   DW_AT_sibling     : <0x3b7>
 <2><39a>: Abbrev Number: 8 (DW_TAG_member)
    <39b>   DW_AT_name        : ISR
    <39f>   DW_AT_decl_file   : 5
    <3a0>   DW_AT_decl_line   : 301
    <3a2>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x33b>
    <3a7>   DW_AT_data_member_location: 0
 <2><3a8>: Abbrev Number: 9 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x8683a): IFCR
    <3ad>   DW_AT_decl_file   : 5
    <3ae>   DW_AT_decl_line   : 302
    <3b0>   DW_AT_decl_column : 17
    <3b1>   DW_AT_type        : <0x33b>
    <3b5>   DW_AT_data_member_location: 4
 <2><3b6>: Abbrev Number: 0
 <1><3b7>: Abbrev Number: 10 (DW_TAG_typedef)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x8624e): DMA_TypeDef
    <3bc>   DW_AT_decl_file   : 5
    <3bd>   DW_AT_decl_line   : 303
    <3bf>   DW_AT_decl_column : 3
    <3c0>   DW_AT_type        : <0x390>
 <1><3c4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3c5>   DW_AT_byte_size   : 28
    <3c6>   DW_AT_decl_file   : 5
    <3c7>   DW_AT_decl_line   : 358
    <3c9>   DW_AT_decl_column : 9
    <3ca>   DW_AT_sibling     : <0x431>
 <2><3ce>: Abbrev Number: 8 (DW_TAG_member)
    <3cf>   DW_AT_name        : CRL
    <3d3>   DW_AT_decl_file   : 5
    <3d4>   DW_AT_decl_line   : 360
    <3d6>   DW_AT_decl_column : 17
    <3d7>   DW_AT_type        : <0x33b>
    <3db>   DW_AT_data_member_location: 0
 <2><3dc>: Abbrev Number: 8 (DW_TAG_member)
    <3dd>   DW_AT_name        : CRH
    <3e1>   DW_AT_decl_file   : 5
    <3e2>   DW_AT_decl_line   : 361
    <3e4>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0x33b>
    <3e9>   DW_AT_data_member_location: 4
 <2><3ea>: Abbrev Number: 8 (DW_TAG_member)
    <3eb>   DW_AT_name        : IDR
    <3ef>   DW_AT_decl_file   : 5
    <3f0>   DW_AT_decl_line   : 362
    <3f2>   DW_AT_decl_column : 17
    <3f3>   DW_AT_type        : <0x33b>
    <3f7>   DW_AT_data_member_location: 8
 <2><3f8>: Abbrev Number: 8 (DW_TAG_member)
    <3f9>   DW_AT_name        : ODR
    <3fd>   DW_AT_decl_file   : 5
    <3fe>   DW_AT_decl_line   : 363
    <400>   DW_AT_decl_column : 17
    <401>   DW_AT_type        : <0x33b>
    <405>   DW_AT_data_member_location: 12
 <2><406>: Abbrev Number: 9 (DW_TAG_member)
    <407>   DW_AT_name        : (indirect string, offset: 0x85fb9): BSRR
    <40b>   DW_AT_decl_file   : 5
    <40c>   DW_AT_decl_line   : 364
    <40e>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x33b>
    <413>   DW_AT_data_member_location: 16
 <2><414>: Abbrev Number: 8 (DW_TAG_member)
    <415>   DW_AT_name        : BRR
    <419>   DW_AT_decl_file   : 5
    <41a>   DW_AT_decl_line   : 365
    <41c>   DW_AT_decl_column : 17
    <41d>   DW_AT_type        : <0x33b>
    <421>   DW_AT_data_member_location: 20
 <2><422>: Abbrev Number: 9 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x86afb): LCKR
    <427>   DW_AT_decl_file   : 5
    <428>   DW_AT_decl_line   : 366
    <42a>   DW_AT_decl_column : 17
    <42b>   DW_AT_type        : <0x33b>
    <42f>   DW_AT_data_member_location: 24
 <2><430>: Abbrev Number: 0
 <1><431>: Abbrev Number: 10 (DW_TAG_typedef)
    <432>   DW_AT_name        : (indirect string, offset: 0x86c7f): GPIO_TypeDef
    <436>   DW_AT_decl_file   : 5
    <437>   DW_AT_decl_line   : 367
    <439>   DW_AT_decl_column : 3
    <43a>   DW_AT_type        : <0x3c4>
 <1><43e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <43f>   DW_AT_byte_size   : 36
    <440>   DW_AT_decl_file   : 5
    <441>   DW_AT_decl_line   : 385
    <443>   DW_AT_decl_column : 9
    <444>   DW_AT_sibling     : <0x4c6>
 <2><448>: Abbrev Number: 8 (DW_TAG_member)
    <449>   DW_AT_name        : CR1
    <44d>   DW_AT_decl_file   : 5
    <44e>   DW_AT_decl_line   : 387
    <450>   DW_AT_decl_column : 17
    <451>   DW_AT_type        : <0x33b>
    <455>   DW_AT_data_member_location: 0
 <2><456>: Abbrev Number: 8 (DW_TAG_member)
    <457>   DW_AT_name        : CR2
    <45b>   DW_AT_decl_file   : 5
    <45c>   DW_AT_decl_line   : 388
    <45e>   DW_AT_decl_column : 17
    <45f>   DW_AT_type        : <0x33b>
    <463>   DW_AT_data_member_location: 4
 <2><464>: Abbrev Number: 9 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0x86081): OAR1
    <469>   DW_AT_decl_file   : 5
    <46a>   DW_AT_decl_line   : 389
    <46c>   DW_AT_decl_column : 17
    <46d>   DW_AT_type        : <0x33b>
    <471>   DW_AT_data_member_location: 8
 <2><472>: Abbrev Number: 9 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x86086): OAR2
    <477>   DW_AT_decl_file   : 5
    <478>   DW_AT_decl_line   : 390
    <47a>   DW_AT_decl_column : 17
    <47b>   DW_AT_type        : <0x33b>
    <47f>   DW_AT_data_member_location: 12
 <2><480>: Abbrev Number: 8 (DW_TAG_member)
    <481>   DW_AT_name        : DR
    <484>   DW_AT_decl_file   : 5
    <485>   DW_AT_decl_line   : 391
    <487>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0x33b>
    <48c>   DW_AT_data_member_location: 16
 <2><48d>: Abbrev Number: 8 (DW_TAG_member)
    <48e>   DW_AT_name        : SR1
    <492>   DW_AT_decl_file   : 5
    <493>   DW_AT_decl_line   : 392
    <495>   DW_AT_decl_column : 17
    <496>   DW_AT_type        : <0x33b>
    <49a>   DW_AT_data_member_location: 20
 <2><49b>: Abbrev Number: 8 (DW_TAG_member)
    <49c>   DW_AT_name        : SR2
    <4a0>   DW_AT_decl_file   : 5
    <4a1>   DW_AT_decl_line   : 393
    <4a3>   DW_AT_decl_column : 17
    <4a4>   DW_AT_type        : <0x33b>
    <4a8>   DW_AT_data_member_location: 24
 <2><4a9>: Abbrev Number: 8 (DW_TAG_member)
    <4aa>   DW_AT_name        : CCR
    <4ae>   DW_AT_decl_file   : 5
    <4af>   DW_AT_decl_line   : 394
    <4b1>   DW_AT_decl_column : 17
    <4b2>   DW_AT_type        : <0x33b>
    <4b6>   DW_AT_data_member_location: 28
 <2><4b7>: Abbrev Number: 9 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x864eb): TRISE
    <4bc>   DW_AT_decl_file   : 5
    <4bd>   DW_AT_decl_line   : 395
    <4bf>   DW_AT_decl_column : 17
    <4c0>   DW_AT_type        : <0x33b>
    <4c4>   DW_AT_data_member_location: 32
 <2><4c5>: Abbrev Number: 0
 <1><4c6>: Abbrev Number: 10 (DW_TAG_typedef)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x869bb): I2C_TypeDef
    <4cb>   DW_AT_decl_file   : 5
    <4cc>   DW_AT_decl_line   : 396
    <4ce>   DW_AT_decl_column : 3
    <4cf>   DW_AT_type        : <0x43e>
 <1><4d3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4d4>   DW_AT_byte_size   : 40
    <4d5>   DW_AT_decl_file   : 5
    <4d6>   DW_AT_decl_line   : 424
    <4d8>   DW_AT_decl_column : 9
    <4d9>   DW_AT_sibling     : <0x569>
 <2><4dd>: Abbrev Number: 8 (DW_TAG_member)
    <4de>   DW_AT_name        : CR
    <4e1>   DW_AT_decl_file   : 5
    <4e2>   DW_AT_decl_line   : 426
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x33b>
    <4e9>   DW_AT_data_member_location: 0
 <2><4ea>: Abbrev Number: 9 (DW_TAG_member)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x866af): CFGR
    <4ef>   DW_AT_decl_file   : 5
    <4f0>   DW_AT_decl_line   : 427
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x33b>
    <4f7>   DW_AT_data_member_location: 4
 <2><4f8>: Abbrev Number: 8 (DW_TAG_member)
    <4f9>   DW_AT_name        : CIR
    <4fd>   DW_AT_decl_file   : 5
    <4fe>   DW_AT_decl_line   : 428
    <500>   DW_AT_decl_column : 17
    <501>   DW_AT_type        : <0x33b>
    <505>   DW_AT_data_member_location: 8
 <2><506>: Abbrev Number: 9 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x86400): APB2RSTR
    <50b>   DW_AT_decl_file   : 5
    <50c>   DW_AT_decl_line   : 429
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x33b>
    <513>   DW_AT_data_member_location: 12
 <2><514>: Abbrev Number: 9 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0x85d6f): APB1RSTR
    <519>   DW_AT_decl_file   : 5
    <51a>   DW_AT_decl_line   : 430
    <51c>   DW_AT_decl_column : 17
    <51d>   DW_AT_type        : <0x33b>
    <521>   DW_AT_data_member_location: 16
 <2><522>: Abbrev Number: 9 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x85d12): AHBENR
    <527>   DW_AT_decl_file   : 5
    <528>   DW_AT_decl_line   : 431
    <52a>   DW_AT_decl_column : 17
    <52b>   DW_AT_type        : <0x33b>
    <52f>   DW_AT_data_member_location: 20
 <2><530>: Abbrev Number: 9 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0x85d9c): APB2ENR
    <535>   DW_AT_decl_file   : 5
    <536>   DW_AT_decl_line   : 432
    <538>   DW_AT_decl_column : 17
    <539>   DW_AT_type        : <0x33b>
    <53d>   DW_AT_data_member_location: 24
 <2><53e>: Abbrev Number: 9 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x8696d): APB1ENR
    <543>   DW_AT_decl_file   : 5
    <544>   DW_AT_decl_line   : 433
    <546>   DW_AT_decl_column : 17
    <547>   DW_AT_type        : <0x33b>
    <54b>   DW_AT_data_member_location: 28
 <2><54c>: Abbrev Number: 9 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x85de0): BDCR
    <551>   DW_AT_decl_file   : 5
    <552>   DW_AT_decl_line   : 434
    <554>   DW_AT_decl_column : 17
    <555>   DW_AT_type        : <0x33b>
    <559>   DW_AT_data_member_location: 32
 <2><55a>: Abbrev Number: 8 (DW_TAG_member)
    <55b>   DW_AT_name        : CSR
    <55f>   DW_AT_decl_file   : 5
    <560>   DW_AT_decl_line   : 435
    <562>   DW_AT_decl_column : 17
    <563>   DW_AT_type        : <0x33b>
    <567>   DW_AT_data_member_location: 36
 <2><568>: Abbrev Number: 0
 <1><569>: Abbrev Number: 10 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x8645c): RCC_TypeDef
    <56e>   DW_AT_decl_file   : 5
    <56f>   DW_AT_decl_line   : 438
    <571>   DW_AT_decl_column : 3
    <572>   DW_AT_type        : <0x4d3>
 <1><576>: Abbrev Number: 7 (DW_TAG_structure_type)
    <577>   DW_AT_byte_size   : 84
    <578>   DW_AT_decl_file   : 5
    <579>   DW_AT_decl_line   : 477
    <57b>   DW_AT_decl_column : 9
    <57c>   DW_AT_sibling     : <0x6a5>
 <2><580>: Abbrev Number: 8 (DW_TAG_member)
    <581>   DW_AT_name        : CR1
    <585>   DW_AT_decl_file   : 5
    <586>   DW_AT_decl_line   : 479
    <588>   DW_AT_decl_column : 17
    <589>   DW_AT_type        : <0x33b>
    <58d>   DW_AT_data_member_location: 0
 <2><58e>: Abbrev Number: 8 (DW_TAG_member)
    <58f>   DW_AT_name        : CR2
    <593>   DW_AT_decl_file   : 5
    <594>   DW_AT_decl_line   : 480
    <596>   DW_AT_decl_column : 17
    <597>   DW_AT_type        : <0x33b>
    <59b>   DW_AT_data_member_location: 4
 <2><59c>: Abbrev Number: 9 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0x605a1): SMCR
    <5a1>   DW_AT_decl_file   : 5
    <5a2>   DW_AT_decl_line   : 481
    <5a4>   DW_AT_decl_column : 17
    <5a5>   DW_AT_type        : <0x33b>
    <5a9>   DW_AT_data_member_location: 8
 <2><5aa>: Abbrev Number: 9 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x2aba3): DIER
    <5af>   DW_AT_decl_file   : 5
    <5b0>   DW_AT_decl_line   : 482
    <5b2>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0x33b>
    <5b7>   DW_AT_data_member_location: 12
 <2><5b8>: Abbrev Number: 8 (DW_TAG_member)
    <5b9>   DW_AT_name        : SR
    <5bc>   DW_AT_decl_file   : 5
    <5bd>   DW_AT_decl_line   : 483
    <5bf>   DW_AT_decl_column : 17
    <5c0>   DW_AT_type        : <0x33b>
    <5c4>   DW_AT_data_member_location: 16
 <2><5c5>: Abbrev Number: 8 (DW_TAG_member)
    <5c6>   DW_AT_name        : EGR
    <5ca>   DW_AT_decl_file   : 5
    <5cb>   DW_AT_decl_line   : 484
    <5cd>   DW_AT_decl_column : 17
    <5ce>   DW_AT_type        : <0x33b>
    <5d2>   DW_AT_data_member_location: 20
 <2><5d3>: Abbrev Number: 9 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x62082): CCMR1
    <5d8>   DW_AT_decl_file   : 5
    <5d9>   DW_AT_decl_line   : 485
    <5db>   DW_AT_decl_column : 17
    <5dc>   DW_AT_type        : <0x33b>
    <5e0>   DW_AT_data_member_location: 24
 <2><5e1>: Abbrev Number: 9 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x3545b): CCMR2
    <5e6>   DW_AT_decl_file   : 5
    <5e7>   DW_AT_decl_line   : 486
    <5e9>   DW_AT_decl_column : 17
    <5ea>   DW_AT_type        : <0x33b>
    <5ee>   DW_AT_data_member_location: 28
 <2><5ef>: Abbrev Number: 9 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x17a54): CCER
    <5f4>   DW_AT_decl_file   : 5
    <5f5>   DW_AT_decl_line   : 487
    <5f7>   DW_AT_decl_column : 17
    <5f8>   DW_AT_type        : <0x33b>
    <5fc>   DW_AT_data_member_location: 32
 <2><5fd>: Abbrev Number: 8 (DW_TAG_member)
    <5fe>   DW_AT_name        : CNT
    <602>   DW_AT_decl_file   : 5
    <603>   DW_AT_decl_line   : 488
    <605>   DW_AT_decl_column : 17
    <606>   DW_AT_type        : <0x33b>
    <60a>   DW_AT_data_member_location: 36
 <2><60b>: Abbrev Number: 8 (DW_TAG_member)
    <60c>   DW_AT_name        : PSC
    <610>   DW_AT_decl_file   : 5
    <611>   DW_AT_decl_line   : 489
    <613>   DW_AT_decl_column : 17
    <614>   DW_AT_type        : <0x33b>
    <618>   DW_AT_data_member_location: 40
 <2><619>: Abbrev Number: 8 (DW_TAG_member)
    <61a>   DW_AT_name        : ARR
    <61e>   DW_AT_decl_file   : 5
    <61f>   DW_AT_decl_line   : 490
    <621>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0x33b>
    <626>   DW_AT_data_member_location: 44
 <2><627>: Abbrev Number: 8 (DW_TAG_member)
    <628>   DW_AT_name        : RCR
    <62c>   DW_AT_decl_file   : 5
    <62d>   DW_AT_decl_line   : 491
    <62f>   DW_AT_decl_column : 17
    <630>   DW_AT_type        : <0x33b>
    <634>   DW_AT_data_member_location: 48
 <2><635>: Abbrev Number: 9 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0xffc9): CCR1
    <63a>   DW_AT_decl_file   : 5
    <63b>   DW_AT_decl_line   : 492
    <63d>   DW_AT_decl_column : 17
    <63e>   DW_AT_type        : <0x33b>
    <642>   DW_AT_data_member_location: 52
 <2><643>: Abbrev Number: 9 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x38420): CCR2
    <648>   DW_AT_decl_file   : 5
    <649>   DW_AT_decl_line   : 493
    <64b>   DW_AT_decl_column : 17
    <64c>   DW_AT_type        : <0x33b>
    <650>   DW_AT_data_member_location: 56
 <2><651>: Abbrev Number: 9 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x66928): CCR3
    <656>   DW_AT_decl_file   : 5
    <657>   DW_AT_decl_line   : 494
    <659>   DW_AT_decl_column : 17
    <65a>   DW_AT_type        : <0x33b>
    <65e>   DW_AT_data_member_location: 60
 <2><65f>: Abbrev Number: 9 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x87dc): CCR4
    <664>   DW_AT_decl_file   : 5
    <665>   DW_AT_decl_line   : 495
    <667>   DW_AT_decl_column : 17
    <668>   DW_AT_type        : <0x33b>
    <66c>   DW_AT_data_member_location: 64
 <2><66d>: Abbrev Number: 9 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x3dcd9): BDTR
    <672>   DW_AT_decl_file   : 5
    <673>   DW_AT_decl_line   : 496
    <675>   DW_AT_decl_column : 17
    <676>   DW_AT_type        : <0x33b>
    <67a>   DW_AT_data_member_location: 68
 <2><67b>: Abbrev Number: 8 (DW_TAG_member)
    <67c>   DW_AT_name        : DCR
    <680>   DW_AT_decl_file   : 5
    <681>   DW_AT_decl_line   : 497
    <683>   DW_AT_decl_column : 17
    <684>   DW_AT_type        : <0x33b>
    <688>   DW_AT_data_member_location: 72
 <2><689>: Abbrev Number: 9 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x73108): DMAR
    <68e>   DW_AT_decl_file   : 5
    <68f>   DW_AT_decl_line   : 498
    <691>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0x33b>
    <696>   DW_AT_data_member_location: 76
 <2><697>: Abbrev Number: 8 (DW_TAG_member)
    <698>   DW_AT_name        : OR
    <69b>   DW_AT_decl_file   : 5
    <69c>   DW_AT_decl_line   : 499
    <69e>   DW_AT_decl_column : 17
    <69f>   DW_AT_type        : <0x33b>
    <6a3>   DW_AT_data_member_location: 80
 <2><6a4>: Abbrev Number: 0
 <1><6a5>: Abbrev Number: 10 (DW_TAG_typedef)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x85f9b): TIM_TypeDef
    <6aa>   DW_AT_decl_file   : 5
    <6ab>   DW_AT_decl_line   : 500
    <6ad>   DW_AT_decl_column : 2
    <6ae>   DW_AT_type        : <0x576>
 <1><6b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <6b3>   DW_AT_name        : (indirect string, offset: 0x7c0c0): size_t
    <6b7>   DW_AT_decl_file   : 6
    <6b8>   DW_AT_decl_line   : 209
    <6b9>   DW_AT_decl_column : 23
    <6ba>   DW_AT_type        : <0x306>
 <1><6be>: Abbrev Number: 2 (DW_TAG_base_type)
    <6bf>   DW_AT_byte_size   : 8
    <6c0>   DW_AT_encoding    : 4	(float)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xcbc8): long double
 <1><6c5>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <6c6>   DW_AT_encoding    : 7	(unsigned)
    <6c7>   DW_AT_byte_size   : 1
    <6c8>   DW_AT_type        : <0x2b6>
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 40
    <6ce>   DW_AT_decl_column : 1
    <6cf>   DW_AT_sibling     : <0x6ec>
 <2><6d3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x86188): HAL_OK
    <6d8>   DW_AT_const_value : 0
 <2><6d9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6da>   DW_AT_name        : (indirect string, offset: 0x866ed): HAL_ERROR
    <6de>   DW_AT_const_value : 1
 <2><6df>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x85e71): HAL_BUSY
    <6e4>   DW_AT_const_value : 2
 <2><6e5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x8609d): HAL_TIMEOUT
    <6ea>   DW_AT_const_value : 3
 <2><6eb>: Abbrev Number: 0
 <1><6ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x85b08): HAL_StatusTypeDef
    <6f1>   DW_AT_decl_file   : 7
    <6f2>   DW_AT_decl_line   : 45
    <6f3>   DW_AT_decl_column : 3
    <6f4>   DW_AT_type        : <0x6c5>
 <1><6f8>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <6f9>   DW_AT_encoding    : 7	(unsigned)
    <6fa>   DW_AT_byte_size   : 1
    <6fb>   DW_AT_type        : <0x2b6>
    <6ff>   DW_AT_decl_file   : 7
    <700>   DW_AT_decl_line   : 51
    <701>   DW_AT_decl_column : 1
    <702>   DW_AT_sibling     : <0x713>
 <2><706>: Abbrev Number: 12 (DW_TAG_enumerator)
    <707>   DW_AT_name        : (indirect string, offset: 0x86905): HAL_UNLOCKED
    <70b>   DW_AT_const_value : 0
 <2><70c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <70d>   DW_AT_name        : (indirect string, offset: 0x86d10): HAL_LOCKED
    <711>   DW_AT_const_value : 1
 <2><712>: Abbrev Number: 0
 <1><713>: Abbrev Number: 3 (DW_TAG_typedef)
    <714>   DW_AT_name        : (indirect string, offset: 0x86654): HAL_LockTypeDef
    <718>   DW_AT_decl_file   : 7
    <719>   DW_AT_decl_line   : 54
    <71a>   DW_AT_decl_column : 3
    <71b>   DW_AT_type        : <0x6f8>
 <1><71f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <720>   DW_AT_byte_size   : 12
    <721>   DW_AT_decl_file   : 8
    <722>   DW_AT_decl_line   : 49
    <723>   DW_AT_decl_column : 9
    <724>   DW_AT_sibling     : <0x750>
 <2><728>: Abbrev Number: 14 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x8676f): PLLState
    <72d>   DW_AT_decl_file   : 8
    <72e>   DW_AT_decl_line   : 51
    <72f>   DW_AT_decl_column : 12
    <730>   DW_AT_type        : <0x32f>
    <734>   DW_AT_data_member_location: 0
 <2><735>: Abbrev Number: 14 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0x8679a): PLLSource
    <73a>   DW_AT_decl_file   : 8
    <73b>   DW_AT_decl_line   : 54
    <73c>   DW_AT_decl_column : 12
    <73d>   DW_AT_type        : <0x32f>
    <741>   DW_AT_data_member_location: 4
 <2><742>: Abbrev Number: 14 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x86bb4): PLLMUL
    <747>   DW_AT_decl_file   : 8
    <748>   DW_AT_decl_line   : 57
    <749>   DW_AT_decl_column : 12
    <74a>   DW_AT_type        : <0x32f>
    <74e>   DW_AT_data_member_location: 8
 <2><74f>: Abbrev Number: 0
 <1><750>: Abbrev Number: 3 (DW_TAG_typedef)
    <751>   DW_AT_name        : (indirect string, offset: 0x8669c): RCC_PLLInitTypeDef
    <755>   DW_AT_decl_file   : 8
    <756>   DW_AT_decl_line   : 59
    <757>   DW_AT_decl_column : 3
    <758>   DW_AT_type        : <0x71f>
 <1><75c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <75d>   DW_AT_byte_size   : 20
    <75e>   DW_AT_decl_file   : 8
    <75f>   DW_AT_decl_line   : 64
    <760>   DW_AT_decl_column : 9
    <761>   DW_AT_sibling     : <0x7a7>
 <2><765>: Abbrev Number: 14 (DW_TAG_member)
    <766>   DW_AT_name        : (indirect string, offset: 0x860d7): ClockType
    <76a>   DW_AT_decl_file   : 8
    <76b>   DW_AT_decl_line   : 66
    <76c>   DW_AT_decl_column : 12
    <76d>   DW_AT_type        : <0x32f>
    <771>   DW_AT_data_member_location: 0
 <2><772>: Abbrev Number: 14 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0x8668f): SYSCLKSource
    <777>   DW_AT_decl_file   : 8
    <778>   DW_AT_decl_line   : 69
    <779>   DW_AT_decl_column : 12
    <77a>   DW_AT_type        : <0x32f>
    <77e>   DW_AT_data_member_location: 4
 <2><77f>: Abbrev Number: 14 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0x86a7b): AHBCLKDivider
    <784>   DW_AT_decl_file   : 8
    <785>   DW_AT_decl_line   : 72
    <786>   DW_AT_decl_column : 12
    <787>   DW_AT_type        : <0x32f>
    <78b>   DW_AT_data_member_location: 8
 <2><78c>: Abbrev Number: 14 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x85c07): APB1CLKDivider
    <791>   DW_AT_decl_file   : 8
    <792>   DW_AT_decl_line   : 75
    <793>   DW_AT_decl_column : 12
    <794>   DW_AT_type        : <0x32f>
    <798>   DW_AT_data_member_location: 12
 <2><799>: Abbrev Number: 14 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0x8643e): APB2CLKDivider
    <79e>   DW_AT_decl_file   : 8
    <79f>   DW_AT_decl_line   : 78
    <7a0>   DW_AT_decl_column : 12
    <7a1>   DW_AT_type        : <0x32f>
    <7a5>   DW_AT_data_member_location: 16
 <2><7a6>: Abbrev Number: 0
 <1><7a7>: Abbrev Number: 3 (DW_TAG_typedef)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x860e1): RCC_ClkInitTypeDef
    <7ac>   DW_AT_decl_file   : 8
    <7ad>   DW_AT_decl_line   : 80
    <7ae>   DW_AT_decl_column : 3
    <7af>   DW_AT_type        : <0x75c>
 <1><7b3>: Abbrev Number: 13 (DW_TAG_structure_type)
    <7b4>   DW_AT_byte_size   : 40
    <7b5>   DW_AT_decl_file   : 9
    <7b6>   DW_AT_decl_line   : 228
    <7b7>   DW_AT_decl_column : 9
    <7b8>   DW_AT_sibling     : <0x826>
 <2><7bc>: Abbrev Number: 14 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x85c61): OscillatorType
    <7c1>   DW_AT_decl_file   : 9
    <7c2>   DW_AT_decl_line   : 230
    <7c3>   DW_AT_decl_column : 12
    <7c4>   DW_AT_type        : <0x32f>
    <7c8>   DW_AT_data_member_location: 0
 <2><7c9>: Abbrev Number: 14 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x86787): HSEState
    <7ce>   DW_AT_decl_file   : 9
    <7cf>   DW_AT_decl_line   : 238
    <7d0>   DW_AT_decl_column : 12
    <7d1>   DW_AT_type        : <0x32f>
    <7d5>   DW_AT_data_member_location: 4
 <2><7d6>: Abbrev Number: 14 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x86778): HSEPredivValue
    <7db>   DW_AT_decl_file   : 9
    <7dc>   DW_AT_decl_line   : 241
    <7dd>   DW_AT_decl_column : 12
    <7de>   DW_AT_type        : <0x32f>
    <7e2>   DW_AT_data_member_location: 8
 <2><7e3>: Abbrev Number: 14 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x866f7): LSEState
    <7e8>   DW_AT_decl_file   : 9
    <7e9>   DW_AT_decl_line   : 244
    <7ea>   DW_AT_decl_column : 12
    <7eb>   DW_AT_type        : <0x32f>
    <7ef>   DW_AT_data_member_location: 12
 <2><7f0>: Abbrev Number: 14 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x86435): HSIState
    <7f5>   DW_AT_decl_file   : 9
    <7f6>   DW_AT_decl_line   : 247
    <7f7>   DW_AT_decl_column : 12
    <7f8>   DW_AT_type        : <0x32f>
    <7fc>   DW_AT_data_member_location: 16
 <2><7fd>: Abbrev Number: 14 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x86b17): HSICalibrationValue
    <802>   DW_AT_decl_file   : 9
    <803>   DW_AT_decl_line   : 250
    <804>   DW_AT_decl_column : 12
    <805>   DW_AT_type        : <0x32f>
    <809>   DW_AT_data_member_location: 20
 <2><80a>: Abbrev Number: 14 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x86b96): LSIState
    <80f>   DW_AT_decl_file   : 9
    <810>   DW_AT_decl_line   : 253
    <811>   DW_AT_decl_column : 12
    <812>   DW_AT_type        : <0x32f>
    <816>   DW_AT_data_member_location: 24
 <2><817>: Abbrev Number: 8 (DW_TAG_member)
    <818>   DW_AT_name        : PLL
    <81c>   DW_AT_decl_file   : 9
    <81d>   DW_AT_decl_line   : 256
    <81f>   DW_AT_decl_column : 22
    <820>   DW_AT_type        : <0x750>
    <824>   DW_AT_data_member_location: 28
 <2><825>: Abbrev Number: 0
 <1><826>: Abbrev Number: 10 (DW_TAG_typedef)
    <827>   DW_AT_name        : (indirect string, offset: 0x8652c): RCC_OscInitTypeDef
    <82b>   DW_AT_decl_file   : 9
    <82c>   DW_AT_decl_line   : 261
    <82e>   DW_AT_decl_column : 3
    <82f>   DW_AT_type        : <0x7b3>
 <1><833>: Abbrev Number: 13 (DW_TAG_structure_type)
    <834>   DW_AT_byte_size   : 16
    <835>   DW_AT_decl_file   : 10
    <836>   DW_AT_decl_line   : 47
    <837>   DW_AT_decl_column : 9
    <838>   DW_AT_sibling     : <0x871>
 <2><83c>: Abbrev Number: 15 (DW_TAG_member)
    <83d>   DW_AT_name        : Pin
    <841>   DW_AT_decl_file   : 10
    <842>   DW_AT_decl_line   : 49
    <843>   DW_AT_decl_column : 12
    <844>   DW_AT_type        : <0x32f>
    <848>   DW_AT_data_member_location: 0
 <2><849>: Abbrev Number: 14 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x89344): Mode
    <84e>   DW_AT_decl_file   : 10
    <84f>   DW_AT_decl_line   : 52
    <850>   DW_AT_decl_column : 12
    <851>   DW_AT_type        : <0x32f>
    <855>   DW_AT_data_member_location: 4
 <2><856>: Abbrev Number: 14 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x85b41): Pull
    <85b>   DW_AT_decl_file   : 10
    <85c>   DW_AT_decl_line   : 55
    <85d>   DW_AT_decl_column : 12
    <85e>   DW_AT_type        : <0x32f>
    <862>   DW_AT_data_member_location: 8
 <2><863>: Abbrev Number: 14 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x86c3d): Speed
    <868>   DW_AT_decl_file   : 10
    <869>   DW_AT_decl_line   : 58
    <86a>   DW_AT_decl_column : 12
    <86b>   DW_AT_type        : <0x32f>
    <86f>   DW_AT_data_member_location: 12
 <2><870>: Abbrev Number: 0
 <1><871>: Abbrev Number: 3 (DW_TAG_typedef)
    <872>   DW_AT_name        : (indirect string, offset: 0x86c0c): GPIO_InitTypeDef
    <876>   DW_AT_decl_file   : 10
    <877>   DW_AT_decl_line   : 60
    <878>   DW_AT_decl_column : 3
    <879>   DW_AT_type        : <0x833>
 <1><87d>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <87e>   DW_AT_encoding    : 7	(unsigned)
    <87f>   DW_AT_byte_size   : 1
    <880>   DW_AT_type        : <0x2b6>
    <884>   DW_AT_decl_file   : 10
    <885>   DW_AT_decl_line   : 66
    <886>   DW_AT_decl_column : 1
    <887>   DW_AT_sibling     : <0x898>
 <2><88b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <88c>   DW_AT_name        : (indirect string, offset: 0x85f63): GPIO_PIN_RESET
    <890>   DW_AT_const_value : 0
 <2><891>: Abbrev Number: 12 (DW_TAG_enumerator)
    <892>   DW_AT_name        : (indirect string, offset: 0x85e7a): GPIO_PIN_SET
    <896>   DW_AT_const_value : 1
 <2><897>: Abbrev Number: 0
 <1><898>: Abbrev Number: 3 (DW_TAG_typedef)
    <899>   DW_AT_name        : (indirect string, offset: 0x86cbe): GPIO_PinState
    <89d>   DW_AT_decl_file   : 10
    <89e>   DW_AT_decl_line   : 69
    <89f>   DW_AT_decl_column : 3
    <8a0>   DW_AT_type        : <0x87d>
 <1><8a4>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8a5>   DW_AT_byte_size   : 28
    <8a6>   DW_AT_decl_file   : 11
    <8a7>   DW_AT_decl_line   : 48
    <8a8>   DW_AT_decl_column : 9
    <8a9>   DW_AT_sibling     : <0x909>
 <2><8ad>: Abbrev Number: 14 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x88772): Direction
    <8b2>   DW_AT_decl_file   : 11
    <8b3>   DW_AT_decl_line   : 50
    <8b4>   DW_AT_decl_column : 12
    <8b5>   DW_AT_type        : <0x32f>
    <8b9>   DW_AT_data_member_location: 0
 <2><8ba>: Abbrev Number: 14 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x85ca8): PeriphInc
    <8bf>   DW_AT_decl_file   : 11
    <8c0>   DW_AT_decl_line   : 54
    <8c1>   DW_AT_decl_column : 12
    <8c2>   DW_AT_type        : <0x32f>
    <8c6>   DW_AT_data_member_location: 4
 <2><8c7>: Abbrev Number: 14 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x85e27): MemInc
    <8cc>   DW_AT_decl_file   : 11
    <8cd>   DW_AT_decl_line   : 57
    <8ce>   DW_AT_decl_column : 12
    <8cf>   DW_AT_type        : <0x32f>
    <8d3>   DW_AT_data_member_location: 8
 <2><8d4>: Abbrev Number: 14 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0x864b9): PeriphDataAlignment
    <8d9>   DW_AT_decl_file   : 11
    <8da>   DW_AT_decl_line   : 60
    <8db>   DW_AT_decl_column : 12
    <8dc>   DW_AT_type        : <0x32f>
    <8e0>   DW_AT_data_member_location: 12
 <2><8e1>: Abbrev Number: 14 (DW_TAG_member)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x86bbb): MemDataAlignment
    <8e6>   DW_AT_decl_file   : 11
    <8e7>   DW_AT_decl_line   : 63
    <8e8>   DW_AT_decl_column : 12
    <8e9>   DW_AT_type        : <0x32f>
    <8ed>   DW_AT_data_member_location: 16
 <2><8ee>: Abbrev Number: 14 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x89344): Mode
    <8f3>   DW_AT_decl_file   : 11
    <8f4>   DW_AT_decl_line   : 66
    <8f5>   DW_AT_decl_column : 12
    <8f6>   DW_AT_type        : <0x32f>
    <8fa>   DW_AT_data_member_location: 20
 <2><8fb>: Abbrev Number: 14 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x87bb0): Priority
    <900>   DW_AT_decl_file   : 11
    <901>   DW_AT_decl_line   : 71
    <902>   DW_AT_decl_column : 12
    <903>   DW_AT_type        : <0x32f>
    <907>   DW_AT_data_member_location: 24
 <2><908>: Abbrev Number: 0
 <1><909>: Abbrev Number: 3 (DW_TAG_typedef)
    <90a>   DW_AT_name        : (indirect string, offset: 0x8604a): DMA_InitTypeDef
    <90e>   DW_AT_decl_file   : 11
    <90f>   DW_AT_decl_line   : 73
    <910>   DW_AT_decl_column : 3
    <911>   DW_AT_type        : <0x8a4>
 <1><915>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <916>   DW_AT_encoding    : 7	(unsigned)
    <917>   DW_AT_byte_size   : 1
    <918>   DW_AT_type        : <0x2b6>
    <91c>   DW_AT_decl_file   : 11
    <91d>   DW_AT_decl_line   : 79
    <91e>   DW_AT_decl_column : 1
    <91f>   DW_AT_sibling     : <0x93c>
 <2><923>: Abbrev Number: 12 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x86912): HAL_DMA_STATE_RESET
    <928>   DW_AT_const_value : 0
 <2><929>: Abbrev Number: 12 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x86066): HAL_DMA_STATE_READY
    <92e>   DW_AT_const_value : 1
 <2><92f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x8680a): HAL_DMA_STATE_BUSY
    <934>   DW_AT_const_value : 2
 <2><935>: Abbrev Number: 12 (DW_TAG_enumerator)
    <936>   DW_AT_name        : (indirect string, offset: 0x86ccc): HAL_DMA_STATE_TIMEOUT
    <93a>   DW_AT_const_value : 3
 <2><93b>: Abbrev Number: 0
 <1><93c>: Abbrev Number: 3 (DW_TAG_typedef)
    <93d>   DW_AT_name        : (indirect string, offset: 0x8675a): HAL_DMA_StateTypeDef
    <941>   DW_AT_decl_file   : 11
    <942>   DW_AT_decl_line   : 84
    <943>   DW_AT_decl_column : 2
    <944>   DW_AT_type        : <0x915>
 <1><948>: Abbrev Number: 16 (DW_TAG_structure_type)
    <949>   DW_AT_name        : (indirect string, offset: 0x86ac5): __DMA_HandleTypeDef
    <94d>   DW_AT_byte_size   : 68
    <94e>   DW_AT_decl_file   : 11
    <94f>   DW_AT_decl_line   : 111
    <950>   DW_AT_decl_column : 16
    <951>   DW_AT_sibling     : <0x9f2>
 <2><955>: Abbrev Number: 14 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x862e9): Instance
    <95a>   DW_AT_decl_file   : 11
    <95b>   DW_AT_decl_line   : 113
    <95c>   DW_AT_decl_column : 26
    <95d>   DW_AT_type        : <0x9f2>
    <961>   DW_AT_data_member_location: 0
 <2><962>: Abbrev Number: 14 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0x86a76): Init
    <967>   DW_AT_decl_file   : 11
    <968>   DW_AT_decl_line   : 115
    <969>   DW_AT_decl_column : 25
    <96a>   DW_AT_type        : <0x909>
    <96e>   DW_AT_data_member_location: 4
 <2><96f>: Abbrev Number: 14 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x5f973): Lock
    <974>   DW_AT_decl_file   : 11
    <975>   DW_AT_decl_line   : 117
    <976>   DW_AT_decl_column : 25
    <977>   DW_AT_type        : <0x713>
    <97b>   DW_AT_data_member_location: 32
 <2><97c>: Abbrev Number: 14 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0x8678a): State
    <981>   DW_AT_decl_file   : 11
    <982>   DW_AT_decl_line   : 119
    <983>   DW_AT_decl_column : 25
    <984>   DW_AT_type        : <0x93c>
    <988>   DW_AT_data_member_location: 33
 <2><989>: Abbrev Number: 14 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0x86c4f): Parent
    <98e>   DW_AT_decl_file   : 11
    <98f>   DW_AT_decl_line   : 121
    <990>   DW_AT_decl_column : 26
    <991>   DW_AT_type        : <0x9f8>
    <995>   DW_AT_data_member_location: 36
 <2><996>: Abbrev Number: 14 (DW_TAG_member)
    <997>   DW_AT_name        : (indirect string, offset: 0x86cff): XferCpltCallback
    <99b>   DW_AT_decl_file   : 11
    <99c>   DW_AT_decl_line   : 123
    <99d>   DW_AT_decl_column : 28
    <99e>   DW_AT_type        : <0xa0b>
    <9a2>   DW_AT_data_member_location: 40
 <2><9a3>: Abbrev Number: 14 (DW_TAG_member)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x8698e): XferHalfCpltCallback
    <9a8>   DW_AT_decl_file   : 11
    <9a9>   DW_AT_decl_line   : 125
    <9aa>   DW_AT_decl_column : 28
    <9ab>   DW_AT_type        : <0xa0b>
    <9af>   DW_AT_data_member_location: 44
 <2><9b0>: Abbrev Number: 14 (DW_TAG_member)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x85de5): XferErrorCallback
    <9b5>   DW_AT_decl_file   : 11
    <9b6>   DW_AT_decl_line   : 127
    <9b7>   DW_AT_decl_column : 28
    <9b8>   DW_AT_type        : <0xa0b>
    <9bc>   DW_AT_data_member_location: 48
 <2><9bd>: Abbrev Number: 14 (DW_TAG_member)
    <9be>   DW_AT_name        : (indirect string, offset: 0x86c1d): XferAbortCallback
    <9c2>   DW_AT_decl_file   : 11
    <9c3>   DW_AT_decl_line   : 129
    <9c4>   DW_AT_decl_column : 28
    <9c5>   DW_AT_type        : <0xa0b>
    <9c9>   DW_AT_data_member_location: 52
 <2><9ca>: Abbrev Number: 14 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x86c93): ErrorCode
    <9cf>   DW_AT_decl_file   : 11
    <9d0>   DW_AT_decl_line   : 131
    <9d1>   DW_AT_decl_column : 25
    <9d2>   DW_AT_type        : <0x33b>
    <9d6>   DW_AT_data_member_location: 56
 <2><9d7>: Abbrev Number: 14 (DW_TAG_member)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x863cb): DmaBaseAddress
    <9dc>   DW_AT_decl_file   : 11
    <9dd>   DW_AT_decl_line   : 133
    <9de>   DW_AT_decl_column : 27
    <9df>   DW_AT_type        : <0xa11>
    <9e3>   DW_AT_data_member_location: 60
 <2><9e4>: Abbrev Number: 14 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x85f72): ChannelIndex
    <9e9>   DW_AT_decl_file   : 11
    <9ea>   DW_AT_decl_line   : 135
    <9eb>   DW_AT_decl_column : 26
    <9ec>   DW_AT_type        : <0x32f>
    <9f0>   DW_AT_data_member_location: 64
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <9f3>   DW_AT_byte_size   : 4
    <9f4>   DW_AT_type        : <0x383>
 <1><9f8>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <9f9>   DW_AT_byte_size   : 4
 <1><9fa>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <9fb>   DW_AT_prototyped  : 1
    <9fb>   DW_AT_sibling     : <0xa05>
 <2><9ff>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <a00>   DW_AT_type        : <0xa05>
 <2><a04>: Abbrev Number: 0
 <1><a05>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
    <a07>   DW_AT_type        : <0x948>
 <1><a0b>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <a0c>   DW_AT_byte_size   : 4
    <a0d>   DW_AT_type        : <0x9fa>
 <1><a11>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <a12>   DW_AT_byte_size   : 4
    <a13>   DW_AT_type        : <0x3b7>
 <1><a17>: Abbrev Number: 3 (DW_TAG_typedef)
    <a18>   DW_AT_name        : (indirect string, offset: 0x86ac7): DMA_HandleTypeDef
    <a1c>   DW_AT_decl_file   : 11
    <a1d>   DW_AT_decl_line   : 137
    <a1e>   DW_AT_decl_column : 3
    <a1f>   DW_AT_type        : <0x948>
 <1><a23>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a24>   DW_AT_byte_size   : 32
    <a25>   DW_AT_decl_file   : 12
    <a26>   DW_AT_decl_line   : 48
    <a27>   DW_AT_decl_column : 9
    <a28>   DW_AT_sibling     : <0xa95>
 <2><a2c>: Abbrev Number: 14 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x86c38): ClockSpeed
    <a31>   DW_AT_decl_file   : 12
    <a32>   DW_AT_decl_line   : 50
    <a33>   DW_AT_decl_column : 12
    <a34>   DW_AT_type        : <0x32f>
    <a38>   DW_AT_data_member_location: 0
 <2><a39>: Abbrev Number: 14 (DW_TAG_member)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x866b4): DutyCycle
    <a3e>   DW_AT_decl_file   : 12
    <a3f>   DW_AT_decl_line   : 53
    <a40>   DW_AT_decl_column : 12
    <a41>   DW_AT_type        : <0x32f>
    <a45>   DW_AT_data_member_location: 4
 <2><a46>: Abbrev Number: 14 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x86236): OwnAddress1
    <a4b>   DW_AT_decl_file   : 12
    <a4c>   DW_AT_decl_line   : 56
    <a4d>   DW_AT_decl_column : 12
    <a4e>   DW_AT_type        : <0x32f>
    <a52>   DW_AT_data_member_location: 8
 <2><a53>: Abbrev Number: 14 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0x863ae): AddressingMode
    <a58>   DW_AT_decl_file   : 12
    <a59>   DW_AT_decl_line   : 59
    <a5a>   DW_AT_decl_column : 12
    <a5b>   DW_AT_type        : <0x32f>
    <a5f>   DW_AT_data_member_location: 12
 <2><a60>: Abbrev Number: 14 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0x86894): DualAddressMode
    <a65>   DW_AT_decl_file   : 12
    <a66>   DW_AT_decl_line   : 62
    <a67>   DW_AT_decl_column : 12
    <a68>   DW_AT_type        : <0x32f>
    <a6c>   DW_AT_data_member_location: 16
 <2><a6d>: Abbrev Number: 14 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x86242): OwnAddress2
    <a72>   DW_AT_decl_file   : 12
    <a73>   DW_AT_decl_line   : 65
    <a74>   DW_AT_decl_column : 12
    <a75>   DW_AT_type        : <0x32f>
    <a79>   DW_AT_data_member_location: 20
 <2><a7a>: Abbrev Number: 14 (DW_TAG_member)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x85e3a): GeneralCallMode
    <a7f>   DW_AT_decl_file   : 12
    <a80>   DW_AT_decl_line   : 68
    <a81>   DW_AT_decl_column : 12
    <a82>   DW_AT_type        : <0x32f>
    <a86>   DW_AT_data_member_location: 24
 <2><a87>: Abbrev Number: 14 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0x860f4): NoStretchMode
    <a8c>   DW_AT_decl_file   : 12
    <a8d>   DW_AT_decl_line   : 71
    <a8e>   DW_AT_decl_column : 12
    <a8f>   DW_AT_type        : <0x32f>
    <a93>   DW_AT_data_member_location: 28
 <2><a94>: Abbrev Number: 0
 <1><a95>: Abbrev Number: 3 (DW_TAG_typedef)
    <a96>   DW_AT_name        : (indirect string, offset: 0x8612b): I2C_InitTypeDef
    <a9a>   DW_AT_decl_file   : 12
    <a9b>   DW_AT_decl_line   : 74
    <a9c>   DW_AT_decl_column : 3
    <a9d>   DW_AT_type        : <0xa23>
 <1><aa1>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <aa2>   DW_AT_encoding    : 7	(unsigned)
    <aa3>   DW_AT_byte_size   : 1
    <aa4>   DW_AT_type        : <0x2b6>
    <aa8>   DW_AT_decl_file   : 12
    <aa9>   DW_AT_decl_line   : 108
    <aaa>   DW_AT_decl_column : 1
    <aab>   DW_AT_sibling     : <0xaf2>
 <2><aaf>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ab0>   DW_AT_name        : (indirect string, offset: 0x85c4d): HAL_I2C_STATE_RESET
    <ab4>   DW_AT_const_value : 0
 <2><ab5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x8615e): HAL_I2C_STATE_READY
    <aba>   DW_AT_const_value : 32
 <2><abb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <abc>   DW_AT_name        : (indirect string, offset: 0x86827): HAL_I2C_STATE_BUSY
    <ac0>   DW_AT_const_value : 36
 <2><ac1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x60821): HAL_I2C_STATE_BUSY_TX
    <ac6>   DW_AT_const_value : 33
 <2><ac7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x2ec04): HAL_I2C_STATE_BUSY_RX
    <acc>   DW_AT_const_value : 34
 <2><acd>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ace>   DW_AT_name        : (indirect string, offset: 0x862fa): HAL_I2C_STATE_LISTEN
    <ad2>   DW_AT_const_value : 40
 <2><ad3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x85fd4): HAL_I2C_STATE_BUSY_TX_LISTEN
    <ad8>   DW_AT_const_value : 41
 <2><ad9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ada>   DW_AT_name        : (indirect string, offset: 0x867b7): HAL_I2C_STATE_BUSY_RX_LISTEN
    <ade>   DW_AT_const_value : 42
 <2><adf>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x86280): HAL_I2C_STATE_ABORT
    <ae4>   DW_AT_const_value : 96
 <2><ae5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x86a89): HAL_I2C_STATE_TIMEOUT
    <aea>   DW_AT_const_value : 160
 <2><aeb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <aec>   DW_AT_name        : (indirect string, offset: 0x86bcc): HAL_I2C_STATE_ERROR
    <af0>   DW_AT_const_value : 224
 <2><af1>: Abbrev Number: 0
 <1><af2>: Abbrev Number: 3 (DW_TAG_typedef)
    <af3>   DW_AT_name        : (indirect string, offset: 0x85e4a): HAL_I2C_StateTypeDef
    <af7>   DW_AT_decl_file   : 12
    <af8>   DW_AT_decl_line   : 123
    <af9>   DW_AT_decl_column : 3
    <afa>   DW_AT_type        : <0xaa1>
 <1><afe>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <aff>   DW_AT_type        : <0xaf2>
 <1><b03>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <b04>   DW_AT_encoding    : 7	(unsigned)
    <b05>   DW_AT_byte_size   : 1
    <b06>   DW_AT_type        : <0x2b6>
    <b0a>   DW_AT_decl_file   : 12
    <b0b>   DW_AT_decl_line   : 148
    <b0c>   DW_AT_decl_column : 1
    <b0d>   DW_AT_sibling     : <0xb2a>
 <2><b11>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b12>   DW_AT_name        : (indirect string, offset: 0x8602c): HAL_I2C_MODE_NONE
    <b16>   DW_AT_const_value : 0
 <2><b17>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b18>   DW_AT_name        : (indirect string, offset: 0x85b1a): HAL_I2C_MODE_MASTER
    <b1c>   DW_AT_const_value : 16
 <2><b1d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x86bec): HAL_I2C_MODE_SLAVE
    <b22>   DW_AT_const_value : 32
 <2><b23>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b24>   DW_AT_name        : (indirect string, offset: 0x8611a): HAL_I2C_MODE_MEM
    <b28>   DW_AT_const_value : 64
 <2><b29>: Abbrev Number: 0
 <1><b2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x864a5): HAL_I2C_ModeTypeDef
    <b2f>   DW_AT_decl_file   : 12
    <b30>   DW_AT_decl_line   : 154
    <b31>   DW_AT_decl_column : 3
    <b32>   DW_AT_type        : <0xb03>
 <1><b36>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b37>   DW_AT_type        : <0xb2a>
 <1><b3b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b3c>   DW_AT_byte_size   : 84
    <b3d>   DW_AT_decl_file   : 12
    <b3e>   DW_AT_decl_line   : 188
    <b3f>   DW_AT_decl_column : 9
    <b40>   DW_AT_sibling     : <0xc22>
 <2><b44>: Abbrev Number: 14 (DW_TAG_member)
    <b45>   DW_AT_name        : (indirect string, offset: 0x862e9): Instance
    <b49>   DW_AT_decl_file   : 12
    <b4a>   DW_AT_decl_line   : 191
    <b4b>   DW_AT_decl_column : 31
    <b4c>   DW_AT_type        : <0xc22>
    <b50>   DW_AT_data_member_location: 0
 <2><b51>: Abbrev Number: 14 (DW_TAG_member)
    <b52>   DW_AT_name        : (indirect string, offset: 0x86a76): Init
    <b56>   DW_AT_decl_file   : 12
    <b57>   DW_AT_decl_line   : 193
    <b58>   DW_AT_decl_column : 30
    <b59>   DW_AT_type        : <0xa95>
    <b5d>   DW_AT_data_member_location: 4
 <2><b5e>: Abbrev Number: 14 (DW_TAG_member)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x85d26): pBuffPtr
    <b63>   DW_AT_decl_file   : 12
    <b64>   DW_AT_decl_line   : 195
    <b65>   DW_AT_decl_column : 31
    <b66>   DW_AT_type        : <0xc28>
    <b6a>   DW_AT_data_member_location: 36
 <2><b6b>: Abbrev Number: 14 (DW_TAG_member)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x861eb): XferSize
    <b70>   DW_AT_decl_file   : 12
    <b71>   DW_AT_decl_line   : 197
    <b72>   DW_AT_decl_column : 30
    <b73>   DW_AT_type        : <0x319>
    <b77>   DW_AT_data_member_location: 40
 <2><b78>: Abbrev Number: 14 (DW_TAG_member)
    <b79>   DW_AT_name        : (indirect string, offset: 0x8681d): XferCount
    <b7d>   DW_AT_decl_file   : 12
    <b7e>   DW_AT_decl_line   : 199
    <b7f>   DW_AT_decl_column : 30
    <b80>   DW_AT_type        : <0x325>
    <b84>   DW_AT_data_member_location: 42
 <2><b85>: Abbrev Number: 14 (DW_TAG_member)
    <b86>   DW_AT_name        : (indirect string, offset: 0x88184): XferOptions
    <b8a>   DW_AT_decl_file   : 12
    <b8b>   DW_AT_decl_line   : 201
    <b8c>   DW_AT_decl_column : 30
    <b8d>   DW_AT_type        : <0x33b>
    <b91>   DW_AT_data_member_location: 44
 <2><b92>: Abbrev Number: 14 (DW_TAG_member)
    <b93>   DW_AT_name        : (indirect string, offset: 0x86427): PreviousState
    <b97>   DW_AT_decl_file   : 12
    <b98>   DW_AT_decl_line   : 203
    <b99>   DW_AT_decl_column : 30
    <b9a>   DW_AT_type        : <0x33b>
    <b9e>   DW_AT_data_member_location: 48
 <2><b9f>: Abbrev Number: 14 (DW_TAG_member)
    <ba0>   DW_AT_name        : (indirect string, offset: 0x86c8c): hdmatx
    <ba4>   DW_AT_decl_file   : 12
    <ba5>   DW_AT_decl_line   : 206
    <ba6>   DW_AT_decl_column : 31
    <ba7>   DW_AT_type        : <0xc2e>
    <bab>   DW_AT_data_member_location: 52
 <2><bac>: Abbrev Number: 14 (DW_TAG_member)
    <bad>   DW_AT_name        : (indirect string, offset: 0x86c78): hdmarx
    <bb1>   DW_AT_decl_file   : 12
    <bb2>   DW_AT_decl_line   : 208
    <bb3>   DW_AT_decl_column : 31
    <bb4>   DW_AT_type        : <0xc2e>
    <bb8>   DW_AT_data_member_location: 56
 <2><bb9>: Abbrev Number: 14 (DW_TAG_member)
    <bba>   DW_AT_name        : (indirect string, offset: 0x5f973): Lock
    <bbe>   DW_AT_decl_file   : 12
    <bbf>   DW_AT_decl_line   : 210
    <bc0>   DW_AT_decl_column : 30
    <bc1>   DW_AT_type        : <0x713>
    <bc5>   DW_AT_data_member_location: 60
 <2><bc6>: Abbrev Number: 14 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x8678a): State
    <bcb>   DW_AT_decl_file   : 12
    <bcc>   DW_AT_decl_line   : 212
    <bcd>   DW_AT_decl_column : 30
    <bce>   DW_AT_type        : <0xafe>
    <bd2>   DW_AT_data_member_location: 61
 <2><bd3>: Abbrev Number: 14 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x89344): Mode
    <bd8>   DW_AT_decl_file   : 12
    <bd9>   DW_AT_decl_line   : 214
    <bda>   DW_AT_decl_column : 30
    <bdb>   DW_AT_type        : <0xb36>
    <bdf>   DW_AT_data_member_location: 62
 <2><be0>: Abbrev Number: 14 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0x86c93): ErrorCode
    <be5>   DW_AT_decl_file   : 12
    <be6>   DW_AT_decl_line   : 216
    <be7>   DW_AT_decl_column : 30
    <be8>   DW_AT_type        : <0x33b>
    <bec>   DW_AT_data_member_location: 64
 <2><bed>: Abbrev Number: 14 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0x8672f): Devaddress
    <bf2>   DW_AT_decl_file   : 12
    <bf3>   DW_AT_decl_line   : 218
    <bf4>   DW_AT_decl_column : 30
    <bf5>   DW_AT_type        : <0x33b>
    <bf9>   DW_AT_data_member_location: 68
 <2><bfa>: Abbrev Number: 14 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x866be): Memaddress
    <bff>   DW_AT_decl_file   : 12
    <c00>   DW_AT_decl_line   : 220
    <c01>   DW_AT_decl_column : 30
    <c02>   DW_AT_type        : <0x33b>
    <c06>   DW_AT_data_member_location: 72
 <2><c07>: Abbrev Number: 14 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0x86468): MemaddSize
    <c0c>   DW_AT_decl_file   : 12
    <c0d>   DW_AT_decl_line   : 222
    <c0e>   DW_AT_decl_column : 30
    <c0f>   DW_AT_type        : <0x33b>
    <c13>   DW_AT_data_member_location: 76
 <2><c14>: Abbrev Number: 14 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x8647f): EventCount
    <c19>   DW_AT_decl_file   : 12
    <c1a>   DW_AT_decl_line   : 224
    <c1b>   DW_AT_decl_column : 30
    <c1c>   DW_AT_type        : <0x33b>
    <c20>   DW_AT_data_member_location: 80
 <2><c21>: Abbrev Number: 0
 <1><c22>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c23>   DW_AT_byte_size   : 4
    <c24>   DW_AT_type        : <0x4c6>
 <1><c28>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c29>   DW_AT_byte_size   : 4
    <c2a>   DW_AT_type        : <0x30d>
 <1><c2e>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c2f>   DW_AT_byte_size   : 4
    <c30>   DW_AT_type        : <0xa17>
 <1><c34>: Abbrev Number: 3 (DW_TAG_typedef)
    <c35>   DW_AT_name        : (indirect string, offset: 0x8619e): I2C_HandleTypeDef
    <c39>   DW_AT_decl_file   : 12
    <c3a>   DW_AT_decl_line   : 244
    <c3b>   DW_AT_decl_column : 3
    <c3c>   DW_AT_type        : <0xb3b>
 <1><c40>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c41>   DW_AT_byte_size   : 24
    <c42>   DW_AT_decl_file   : 13
    <c43>   DW_AT_decl_line   : 47
    <c44>   DW_AT_decl_column : 9
    <c45>   DW_AT_sibling     : <0xc98>
 <2><c49>: Abbrev Number: 14 (DW_TAG_member)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x89456): Prescaler
    <c4e>   DW_AT_decl_file   : 13
    <c4f>   DW_AT_decl_line   : 49
    <c50>   DW_AT_decl_column : 12
    <c51>   DW_AT_type        : <0x32f>
    <c55>   DW_AT_data_member_location: 0
 <2><c56>: Abbrev Number: 14 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0x86be0): CounterMode
    <c5b>   DW_AT_decl_file   : 13
    <c5c>   DW_AT_decl_line   : 52
    <c5d>   DW_AT_decl_column : 12
    <c5e>   DW_AT_type        : <0x32f>
    <c62>   DW_AT_data_member_location: 4
 <2><c63>: Abbrev Number: 14 (DW_TAG_member)
    <c64>   DW_AT_name        : (indirect string, offset: 0x869af): Period
    <c68>   DW_AT_decl_file   : 13
    <c69>   DW_AT_decl_line   : 55
    <c6a>   DW_AT_decl_column : 12
    <c6b>   DW_AT_type        : <0x32f>
    <c6f>   DW_AT_data_member_location: 8
 <2><c70>: Abbrev Number: 14 (DW_TAG_member)
    <c71>   DW_AT_name        : (indirect string, offset: 0x8632c): ClockDivision
    <c75>   DW_AT_decl_file   : 13
    <c76>   DW_AT_decl_line   : 59
    <c77>   DW_AT_decl_column : 12
    <c78>   DW_AT_type        : <0x32f>
    <c7c>   DW_AT_data_member_location: 12
 <2><c7d>: Abbrev Number: 14 (DW_TAG_member)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x8683f): RepetitionCounter
    <c82>   DW_AT_decl_file   : 13
    <c83>   DW_AT_decl_line   : 62
    <c84>   DW_AT_decl_column : 12
    <c85>   DW_AT_type        : <0x32f>
    <c89>   DW_AT_data_member_location: 16
 <2><c8a>: Abbrev Number: 14 (DW_TAG_member)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x85d44): AutoReloadPreload
    <c8f>   DW_AT_decl_file   : 13
    <c90>   DW_AT_decl_line   : 73
    <c91>   DW_AT_decl_column : 12
    <c92>   DW_AT_type        : <0x32f>
    <c96>   DW_AT_data_member_location: 20
 <2><c97>: Abbrev Number: 0
 <1><c98>: Abbrev Number: 3 (DW_TAG_typedef)
    <c99>   DW_AT_name        : (indirect string, offset: 0x86b9f): TIM_Base_InitTypeDef
    <c9d>   DW_AT_decl_file   : 13
    <c9e>   DW_AT_decl_line   : 75
    <c9f>   DW_AT_decl_column : 3
    <ca0>   DW_AT_type        : <0xc40>
 <1><ca4>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ca5>   DW_AT_byte_size   : 16
    <ca6>   DW_AT_decl_file   : 13
    <ca7>   DW_AT_decl_line   : 199
    <ca8>   DW_AT_decl_column : 9
    <ca9>   DW_AT_sibling     : <0xce2>
 <2><cad>: Abbrev Number: 14 (DW_TAG_member)
    <cae>   DW_AT_name        : (indirect string, offset: 0x85e05): ClockSource
    <cb2>   DW_AT_decl_file   : 13
    <cb3>   DW_AT_decl_line   : 201
    <cb4>   DW_AT_decl_column : 12
    <cb5>   DW_AT_type        : <0x32f>
    <cb9>   DW_AT_data_member_location: 0
 <2><cba>: Abbrev Number: 14 (DW_TAG_member)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x8658e): ClockPolarity
    <cbf>   DW_AT_decl_file   : 13
    <cc0>   DW_AT_decl_line   : 203
    <cc1>   DW_AT_decl_column : 12
    <cc2>   DW_AT_type        : <0x32f>
    <cc6>   DW_AT_data_member_location: 4
 <2><cc7>: Abbrev Number: 14 (DW_TAG_member)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x86b6e): ClockPrescaler
    <ccc>   DW_AT_decl_file   : 13
    <ccd>   DW_AT_decl_line   : 205
    <cce>   DW_AT_decl_column : 12
    <ccf>   DW_AT_type        : <0x32f>
    <cd3>   DW_AT_data_member_location: 8
 <2><cd4>: Abbrev Number: 14 (DW_TAG_member)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x86723): ClockFilter
    <cd9>   DW_AT_decl_file   : 13
    <cda>   DW_AT_decl_line   : 207
    <cdb>   DW_AT_decl_column : 12
    <cdc>   DW_AT_type        : <0x32f>
    <ce0>   DW_AT_data_member_location: 12
 <2><ce1>: Abbrev Number: 0
 <1><ce2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x85bba): TIM_ClockConfigTypeDef
    <ce7>   DW_AT_decl_file   : 13
    <ce8>   DW_AT_decl_line   : 209
    <ce9>   DW_AT_decl_column : 3
    <cea>   DW_AT_type        : <0xca4>
 <1><cee>: Abbrev Number: 13 (DW_TAG_structure_type)
    <cef>   DW_AT_byte_size   : 8
    <cf0>   DW_AT_decl_file   : 13
    <cf1>   DW_AT_decl_line   : 232
    <cf2>   DW_AT_decl_column : 9
    <cf3>   DW_AT_sibling     : <0xd12>
 <2><cf7>: Abbrev Number: 14 (DW_TAG_member)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x86640): MasterOutputTrigger
    <cfc>   DW_AT_decl_file   : 13
    <cfd>   DW_AT_decl_line   : 234
    <cfe>   DW_AT_decl_column : 13
    <cff>   DW_AT_type        : <0x32f>
    <d03>   DW_AT_data_member_location: 0
 <2><d04>: Abbrev Number: 14 (DW_TAG_member)
    <d05>   DW_AT_name        : (indirect string, offset: 0x86505): MasterSlaveMode
    <d09>   DW_AT_decl_file   : 13
    <d0a>   DW_AT_decl_line   : 236
    <d0b>   DW_AT_decl_column : 13
    <d0c>   DW_AT_type        : <0x32f>
    <d10>   DW_AT_data_member_location: 4
 <2><d11>: Abbrev Number: 0
 <1><d12>: Abbrev Number: 3 (DW_TAG_typedef)
    <d13>   DW_AT_name        : (indirect string, offset: 0x868a4): TIM_MasterConfigTypeDef
    <d17>   DW_AT_decl_file   : 13
    <d18>   DW_AT_decl_line   : 243
    <d19>   DW_AT_decl_column : 3
    <d1a>   DW_AT_type        : <0xcee>
 <1><d1e>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d1f>   DW_AT_encoding    : 7	(unsigned)
    <d20>   DW_AT_byte_size   : 1
    <d21>   DW_AT_type        : <0x2b6>
    <d25>   DW_AT_decl_file   : 13
    <d26>   DW_AT_decl_line   : 292
    <d28>   DW_AT_decl_column : 1
    <d29>   DW_AT_sibling     : <0xd4c>
 <2><d2d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d2e>   DW_AT_name        : (indirect string, offset: 0x864cd): HAL_TIM_STATE_RESET
    <d32>   DW_AT_const_value : 0
 <2><d33>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d34>   DW_AT_name        : (indirect string, offset: 0x85be1): HAL_TIM_STATE_READY
    <d38>   DW_AT_const_value : 1
 <2><d39>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x85ff1): HAL_TIM_STATE_BUSY
    <d3e>   DW_AT_const_value : 2
 <2><d3f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d40>   DW_AT_name        : (indirect string, offset: 0x86a9f): HAL_TIM_STATE_TIMEOUT
    <d44>   DW_AT_const_value : 3
 <2><d45>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d46>   DW_AT_name        : (indirect string, offset: 0x8625a): HAL_TIM_STATE_ERROR
    <d4a>   DW_AT_const_value : 4
 <2><d4b>: Abbrev Number: 0
 <1><d4c>: Abbrev Number: 10 (DW_TAG_typedef)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x868d7): HAL_TIM_StateTypeDef
    <d51>   DW_AT_decl_file   : 13
    <d52>   DW_AT_decl_line   : 298
    <d54>   DW_AT_decl_column : 3
    <d55>   DW_AT_type        : <0xd1e>
 <1><d59>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d5a>   DW_AT_type        : <0xd4c>
 <1><d5e>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d5f>   DW_AT_encoding    : 7	(unsigned)
    <d60>   DW_AT_byte_size   : 1
    <d61>   DW_AT_type        : <0x2b6>
    <d65>   DW_AT_decl_file   : 13
    <d66>   DW_AT_decl_line   : 304
    <d68>   DW_AT_decl_column : 1
    <d69>   DW_AT_sibling     : <0xd80>
 <2><d6d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x861f4): HAL_TIM_CHANNEL_STATE_RESET
    <d72>   DW_AT_const_value : 0
 <2><d73>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d74>   DW_AT_name        : (indirect string, offset: 0x86624): HAL_TIM_CHANNEL_STATE_READY
    <d78>   DW_AT_const_value : 1
 <2><d79>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x8648a): HAL_TIM_CHANNEL_STATE_BUSY
    <d7e>   DW_AT_const_value : 2
 <2><d7f>: Abbrev Number: 0
 <1><d80>: Abbrev Number: 10 (DW_TAG_typedef)
    <d81>   DW_AT_name        : (indirect string, offset: 0x85f7f): HAL_TIM_ChannelStateTypeDef
    <d85>   DW_AT_decl_file   : 13
    <d86>   DW_AT_decl_line   : 308
    <d88>   DW_AT_decl_column : 3
    <d89>   DW_AT_type        : <0xd5e>
 <1><d8d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d8e>   DW_AT_type        : <0xd80>
 <1><d92>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d93>   DW_AT_encoding    : 7	(unsigned)
    <d94>   DW_AT_byte_size   : 1
    <d95>   DW_AT_type        : <0x2b6>
    <d99>   DW_AT_decl_file   : 13
    <d9a>   DW_AT_decl_line   : 314
    <d9c>   DW_AT_decl_column : 1
    <d9d>   DW_AT_sibling     : <0xdb4>
 <2><da1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <da2>   DW_AT_name        : (indirect string, offset: 0x85b46): HAL_DMA_BURST_STATE_RESET
    <da6>   DW_AT_const_value : 0
 <2><da7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <da8>   DW_AT_name        : (indirect string, offset: 0x86548): HAL_DMA_BURST_STATE_READY
    <dac>   DW_AT_const_value : 1
 <2><dad>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dae>   DW_AT_name        : (indirect string, offset: 0x86947): HAL_DMA_BURST_STATE_BUSY
    <db2>   DW_AT_const_value : 2
 <2><db3>: Abbrev Number: 0
 <1><db4>: Abbrev Number: 10 (DW_TAG_typedef)
    <db5>   DW_AT_name        : (indirect string, offset: 0x85dc3): HAL_TIM_DMABurstStateTypeDef
    <db9>   DW_AT_decl_file   : 13
    <dba>   DW_AT_decl_line   : 318
    <dbc>   DW_AT_decl_column : 3
    <dbd>   DW_AT_type        : <0xd92>
 <1><dc1>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <dc2>   DW_AT_type        : <0xdb4>
 <1><dc6>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <dc7>   DW_AT_encoding    : 7	(unsigned)
    <dc8>   DW_AT_byte_size   : 1
    <dc9>   DW_AT_type        : <0x2b6>
    <dcd>   DW_AT_decl_file   : 13
    <dce>   DW_AT_decl_line   : 324
    <dd0>   DW_AT_decl_column : 1
    <dd1>   DW_AT_sibling     : <0xdf4>
 <2><dd5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x865b5): HAL_TIM_ACTIVE_CHANNEL_1
    <dda>   DW_AT_const_value : 1
 <2><ddb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x865ce): HAL_TIM_ACTIVE_CHANNEL_2
    <de0>   DW_AT_const_value : 2
 <2><de1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <de2>   DW_AT_name        : (indirect string, offset: 0x865e7): HAL_TIM_ACTIVE_CHANNEL_3
    <de6>   DW_AT_const_value : 4
 <2><de7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <de8>   DW_AT_name        : (indirect string, offset: 0x86600): HAL_TIM_ACTIVE_CHANNEL_4
    <dec>   DW_AT_const_value : 8
 <2><ded>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dee>   DW_AT_name        : (indirect string, offset: 0x86354): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <df2>   DW_AT_const_value : 0
 <2><df3>: Abbrev Number: 0
 <1><df4>: Abbrev Number: 10 (DW_TAG_typedef)
    <df5>   DW_AT_name        : (indirect string, offset: 0x85f3f): HAL_TIM_ActiveChannel
    <df9>   DW_AT_decl_file   : 13
    <dfa>   DW_AT_decl_line   : 330
    <dfc>   DW_AT_decl_column : 3
    <dfd>   DW_AT_type        : <0xdc6>
 <1><e01>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e02>   DW_AT_byte_size   : 72
    <e03>   DW_AT_decl_file   : 13
    <e04>   DW_AT_decl_line   : 338
    <e06>   DW_AT_decl_column : 9
    <e07>   DW_AT_sibling     : <0xe8a>
 <2><e0b>: Abbrev Number: 9 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x862e9): Instance
    <e10>   DW_AT_decl_file   : 13
    <e11>   DW_AT_decl_line   : 341
    <e13>   DW_AT_decl_column : 39
    <e14>   DW_AT_type        : <0xe8a>
    <e18>   DW_AT_data_member_location: 0
 <2><e19>: Abbrev Number: 9 (DW_TAG_member)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x86a76): Init
    <e1e>   DW_AT_decl_file   : 13
    <e1f>   DW_AT_decl_line   : 342
    <e21>   DW_AT_decl_column : 38
    <e22>   DW_AT_type        : <0xc98>
    <e26>   DW_AT_data_member_location: 4
 <2><e27>: Abbrev Number: 9 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x85f4d): Channel
    <e2c>   DW_AT_decl_file   : 13
    <e2d>   DW_AT_decl_line   : 343
    <e2f>   DW_AT_decl_column : 38
    <e30>   DW_AT_type        : <0xdf4>
    <e34>   DW_AT_data_member_location: 28
 <2><e35>: Abbrev Number: 9 (DW_TAG_member)
    <e36>   DW_AT_name        : (indirect string, offset: 0x8667d): hdma
    <e3a>   DW_AT_decl_file   : 13
    <e3b>   DW_AT_decl_line   : 344
    <e3d>   DW_AT_decl_column : 39
    <e3e>   DW_AT_type        : <0xe90>
    <e42>   DW_AT_data_member_location: 32
 <2><e43>: Abbrev Number: 9 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0x5f973): Lock
    <e48>   DW_AT_decl_file   : 13
    <e49>   DW_AT_decl_line   : 346
    <e4b>   DW_AT_decl_column : 38
    <e4c>   DW_AT_type        : <0x713>
    <e50>   DW_AT_data_member_location: 60
 <2><e51>: Abbrev Number: 9 (DW_TAG_member)
    <e52>   DW_AT_name        : (indirect string, offset: 0x8678a): State
    <e56>   DW_AT_decl_file   : 13
    <e57>   DW_AT_decl_line   : 347
    <e59>   DW_AT_decl_column : 38
    <e5a>   DW_AT_type        : <0xd59>
    <e5e>   DW_AT_data_member_location: 61
 <2><e5f>: Abbrev Number: 9 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0x8999b): ChannelState
    <e64>   DW_AT_decl_file   : 13
    <e65>   DW_AT_decl_line   : 348
    <e67>   DW_AT_decl_column : 38
    <e68>   DW_AT_type        : <0xeb0>
    <e6c>   DW_AT_data_member_location: 62
 <2><e6d>: Abbrev Number: 9 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x89f2e): ChannelNState
    <e72>   DW_AT_decl_file   : 13
    <e73>   DW_AT_decl_line   : 349
    <e75>   DW_AT_decl_column : 38
    <e76>   DW_AT_type        : <0xeb0>
    <e7a>   DW_AT_data_member_location: 66
 <2><e7b>: Abbrev Number: 9 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x89514): DMABurstState
    <e80>   DW_AT_decl_file   : 13
    <e81>   DW_AT_decl_line   : 350
    <e83>   DW_AT_decl_column : 38
    <e84>   DW_AT_type        : <0xdc1>
    <e88>   DW_AT_data_member_location: 70
 <2><e89>: Abbrev Number: 0
 <1><e8a>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <e8b>   DW_AT_byte_size   : 4
    <e8c>   DW_AT_type        : <0x6a5>
 <1><e90>: Abbrev Number: 22 (DW_TAG_array_type)
    <e91>   DW_AT_type        : <0xc2e>
    <e95>   DW_AT_sibling     : <0xea0>
 <2><e99>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <e9a>   DW_AT_type        : <0x306>
    <e9e>   DW_AT_upper_bound : 6
 <2><e9f>: Abbrev Number: 0
 <1><ea0>: Abbrev Number: 22 (DW_TAG_array_type)
    <ea1>   DW_AT_type        : <0xd8d>
    <ea5>   DW_AT_sibling     : <0xeb0>
 <2><ea9>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <eaa>   DW_AT_type        : <0x306>
    <eae>   DW_AT_upper_bound : 3
 <2><eaf>: Abbrev Number: 0
 <1><eb0>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <eb1>   DW_AT_type        : <0xea0>
 <1><eb5>: Abbrev Number: 10 (DW_TAG_typedef)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x861c1): TIM_HandleTypeDef
    <eba>   DW_AT_decl_file   : 13
    <ebb>   DW_AT_decl_line   : 381
    <ebd>   DW_AT_decl_column : 3
    <ebe>   DW_AT_type        : <0xe01>
 <1><ec2>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <ec3>   DW_AT_byte_size   : 4
    <ec4>   DW_AT_type        : <0xec8>
 <1><ec8>: Abbrev Number: 2 (DW_TAG_base_type)
    <ec9>   DW_AT_byte_size   : 1
    <eca>   DW_AT_encoding    : 8	(unsigned char)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x42d6d): char
 <1><ecf>: Abbrev Number: 6 (DW_TAG_const_type)
    <ed0>   DW_AT_type        : <0xec8>
 <1><ed4>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <ed5>   DW_AT_byte_size   : 4
    <ed6>   DW_AT_type        : <0xecf>
 <1><eda>: Abbrev Number: 13 (DW_TAG_structure_type)
    <edb>   DW_AT_byte_size   : 8
    <edc>   DW_AT_decl_file   : 14
    <edd>   DW_AT_decl_line   : 53
    <ede>   DW_AT_decl_column : 9
    <edf>   DW_AT_sibling     : <0xf0b>
 <2><ee3>: Abbrev Number: 14 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x1a4e4): FontWidth
    <ee8>   DW_AT_decl_file   : 14
    <ee9>   DW_AT_decl_line   : 54
    <eea>   DW_AT_decl_column : 10
    <eeb>   DW_AT_type        : <0x30d>
    <eef>   DW_AT_data_member_location: 0
 <2><ef0>: Abbrev Number: 14 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x9f86): FontHeight
    <ef5>   DW_AT_decl_file   : 14
    <ef6>   DW_AT_decl_line   : 55
    <ef7>   DW_AT_decl_column : 10
    <ef8>   DW_AT_type        : <0x30d>
    <efc>   DW_AT_data_member_location: 1
 <2><efd>: Abbrev Number: 14 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0x3e7dc): data
    <f02>   DW_AT_decl_file   : 14
    <f03>   DW_AT_decl_line   : 56
    <f04>   DW_AT_decl_column : 18
    <f05>   DW_AT_type        : <0xf0b>
    <f09>   DW_AT_data_member_location: 4
 <2><f0a>: Abbrev Number: 0
 <1><f0b>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <f0c>   DW_AT_byte_size   : 4
    <f0d>   DW_AT_type        : <0x32a>
 <1><f11>: Abbrev Number: 3 (DW_TAG_typedef)
    <f12>   DW_AT_name        : (indirect string, offset: 0xfe03): FontDef_t
    <f16>   DW_AT_decl_file   : 14
    <f17>   DW_AT_decl_line   : 57
    <f18>   DW_AT_decl_column : 3
    <f19>   DW_AT_type        : <0xeda>
 <1><f1d>: Abbrev Number: 24 (DW_TAG_variable)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x16708): Font_7x10
    <f22>   DW_AT_decl_file   : 14
    <f23>   DW_AT_decl_line   : 80
    <f24>   DW_AT_decl_column : 18
    <f25>   DW_AT_type        : <0xf11>
    <f29>   DW_AT_external    : 1
    <f29>   DW_AT_declaration : 1
 <1><f29>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <f2a>   DW_AT_encoding    : 7	(unsigned)
    <f2b>   DW_AT_byte_size   : 1
    <f2c>   DW_AT_type        : <0x2b6>
    <f30>   DW_AT_decl_file   : 15
    <f31>   DW_AT_decl_line   : 75
    <f32>   DW_AT_decl_column : 14
    <f33>   DW_AT_sibling     : <0xf44>
 <2><f37>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0x85f11): SSD1306_COLOR_BLACK
    <f3c>   DW_AT_const_value : 0
 <2><f3d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x8614a): SSD1306_COLOR_WHITE
    <f42>   DW_AT_const_value : 1
 <2><f43>: Abbrev Number: 0
 <1><f44>: Abbrev Number: 3 (DW_TAG_typedef)
    <f45>   DW_AT_name        : (indirect string, offset: 0x86409): SSD1306_COLOR_t
    <f49>   DW_AT_decl_file   : 15
    <f4a>   DW_AT_decl_line   : 78
    <f4b>   DW_AT_decl_column : 3
    <f4c>   DW_AT_type        : <0xf29>
 <1><f50>: Abbrev Number: 25 (DW_TAG_variable)
    <f51>   DW_AT_name        : (indirect string, offset: 0x85b95): hi2c1
    <f55>   DW_AT_decl_file   : 1
    <f56>   DW_AT_decl_line   : 55
    <f57>   DW_AT_decl_column : 19
    <f58>   DW_AT_type        : <0xc34>
    <f5c>   DW_AT_external    : 1
    <f5c>   DW_AT_location    : 5 byte block: 3 8 9 0 20 	(DW_OP_addr: 20000908)
 <1><f62>: Abbrev Number: 25 (DW_TAG_variable)
    <f63>   DW_AT_name        : (indirect string, offset: 0x86b90): htim1
    <f67>   DW_AT_decl_file   : 1
    <f68>   DW_AT_decl_line   : 57
    <f69>   DW_AT_decl_column : 19
    <f6a>   DW_AT_type        : <0xeb5>
    <f6e>   DW_AT_external    : 1
    <f6e>   DW_AT_location    : 5 byte block: 3 5c 9 0 20 	(DW_OP_addr: 2000095c)
 <1><f74>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f75>   DW_AT_name        : (indirect string, offset: 0x85da4): menu_variable
    <f79>   DW_AT_byte_size   : 24
    <f7a>   DW_AT_decl_file   : 1
    <f7b>   DW_AT_decl_line   : 64
    <f7c>   DW_AT_decl_column : 16
    <f7d>   DW_AT_sibling     : <0xfa9>
 <2><f81>: Abbrev Number: 14 (DW_TAG_member)
    <f82>   DW_AT_name        : (indirect string, offset: 0x86a4e): index
    <f86>   DW_AT_decl_file   : 1
    <f87>   DW_AT_decl_line   : 65
    <f88>   DW_AT_decl_column : 7
    <f89>   DW_AT_type        : <0xfa9>
    <f8d>   DW_AT_data_member_location: 0
 <2><f8e>: Abbrev Number: 14 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x862f2): menu_id
    <f93>   DW_AT_decl_file   : 1
    <f94>   DW_AT_decl_line   : 66
    <f95>   DW_AT_decl_column : 6
    <f96>   DW_AT_type        : <0x2ff>
    <f9a>   DW_AT_data_member_location: 16
 <2><f9b>: Abbrev Number: 14 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x861b0): adc_sensor_value
    <fa0>   DW_AT_decl_file   : 1
    <fa1>   DW_AT_decl_line   : 67
    <fa2>   DW_AT_decl_column : 6
    <fa3>   DW_AT_type        : <0x2ff>
    <fa7>   DW_AT_data_member_location: 20
 <2><fa8>: Abbrev Number: 0
 <1><fa9>: Abbrev Number: 22 (DW_TAG_array_type)
    <faa>   DW_AT_type        : <0xec8>
    <fae>   DW_AT_sibling     : <0xfb9>
 <2><fb2>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <fb3>   DW_AT_type        : <0x306>
    <fb7>   DW_AT_upper_bound : 14
 <2><fb8>: Abbrev Number: 0
 <1><fb9>: Abbrev Number: 3 (DW_TAG_typedef)
    <fba>   DW_AT_name        : (indirect string, offset: 0x86045): menu
    <fbe>   DW_AT_decl_file   : 1
    <fbf>   DW_AT_decl_line   : 68
    <fc0>   DW_AT_decl_column : 2
    <fc1>   DW_AT_type        : <0xf74>
 <1><fc5>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <fc6>   DW_AT_name        : (indirect string, offset: 0x85e2e): menu_titles
    <fca>   DW_AT_encoding    : 7	(unsigned)
    <fcb>   DW_AT_byte_size   : 1
    <fcc>   DW_AT_type        : <0x2b6>
    <fd0>   DW_AT_decl_file   : 1
    <fd1>   DW_AT_decl_line   : 70
    <fd2>   DW_AT_decl_column : 14
    <fd3>   DW_AT_sibling     : <0x103e>
 <2><fd7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x8653f): mainmenu
    <fdc>   DW_AT_const_value : 0
 <2><fdd>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fde>   DW_AT_name        : (indirect string, offset: 0x8630f): DEVICE_SETTINGS
    <fe2>   DW_AT_const_value : 1
 <2><fe3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x863bd): TEMP_SETTINGS
    <fe8>   DW_AT_const_value : 2
 <2><fe9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fea>   DW_AT_name        : (indirect string, offset: 0x85e87): LIMIT_SETTINGS
    <fee>   DW_AT_const_value : 3
 <2><fef>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x8673a): CO2_SETTINGS
    <ff4>   DW_AT_const_value : 4
 <2><ff5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x86a54): ABOUT
    <ffa>   DW_AT_const_value : 5
 <2><ffb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x86c65): device_adress
    <1000>   DW_AT_const_value : 6
 <2><1001>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1002>   DW_AT_name        : (indirect string, offset: 0x86385): device_calibration
    <1006>   DW_AT_const_value : 7
 <2><1007>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1008>   DW_AT_name        : (indirect string, offset: 0x86682): device_reset
    <100c>   DW_AT_const_value : 8
 <2><100d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <100e>   DW_AT_name        : (indirect string, offset: 0x86b59): device_factory_reset
    <1012>   DW_AT_const_value : 9
 <2><1013>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1014>   DW_AT_name        : (indirect string, offset: 0x85bd5): temp_offset
    <1018>   DW_AT_const_value : 10
 <2><1019>: Abbrev Number: 12 (DW_TAG_enumerator)
    <101a>   DW_AT_name        : (indirect string, offset: 0x8608b): limits_temp
    <101e>   DW_AT_const_value : 11
 <2><101f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1020>   DW_AT_name        : (indirect string, offset: 0x85d56): limits_co2
    <1024>   DW_AT_const_value : 12
 <2><1025>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1026>   DW_AT_name        : (indirect string, offset: 0x85bd1): co2_temp_offset
    <102a>   DW_AT_const_value : 13
 <2><102b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <102c>   DW_AT_name        : (indirect string, offset: 0x85d19): co2_altitute
    <1030>   DW_AT_const_value : 14
 <2><1031>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1032>   DW_AT_name        : (indirect string, offset: 0x85baa): co2_calibration
    <1036>   DW_AT_const_value : 15
 <2><1037>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1038>   DW_AT_name        : (indirect string, offset: 0x86473): co2_offsett
    <103c>   DW_AT_const_value : 16
 <2><103d>: Abbrev Number: 0
 <1><103e>: Abbrev Number: 25 (DW_TAG_variable)
    <103f>   DW_AT_name        : (indirect string, offset: 0x86a3a): main_menu_flag
    <1043>   DW_AT_decl_file   : 1
    <1044>   DW_AT_decl_line   : 92
    <1045>   DW_AT_decl_column : 5
    <1046>   DW_AT_type        : <0x2ff>
    <104a>   DW_AT_external    : 1
    <104a>   DW_AT_location    : 5 byte block: 3 a4 9 0 20 	(DW_OP_addr: 200009a4)
 <1><1050>: Abbrev Number: 25 (DW_TAG_variable)
    <1051>   DW_AT_name        : (indirect string, offset: 0x8605a): page_memory
    <1055>   DW_AT_decl_file   : 1
    <1056>   DW_AT_decl_line   : 93
    <1057>   DW_AT_decl_column : 5
    <1058>   DW_AT_type        : <0x2ff>
    <105c>   DW_AT_external    : 1
    <105c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1062>: Abbrev Number: 25 (DW_TAG_variable)
    <1063>   DW_AT_name        : (indirect string, offset: 0x86980): buton_up_flag
    <1067>   DW_AT_decl_file   : 1
    <1068>   DW_AT_decl_line   : 94
    <1069>   DW_AT_decl_column : 5
    <106a>   DW_AT_type        : <0x2ff>
    <106e>   DW_AT_external    : 1
    <106e>   DW_AT_location    : 5 byte block: 3 a8 9 0 20 	(DW_OP_addr: 200009a8)
 <1><1074>: Abbrev Number: 25 (DW_TAG_variable)
    <1075>   DW_AT_name        : (indirect string, offset: 0x86d1b): buton_down_flag
    <1079>   DW_AT_decl_file   : 1
    <107a>   DW_AT_decl_line   : 95
    <107b>   DW_AT_decl_column : 5
    <107c>   DW_AT_type        : <0x2ff>
    <1080>   DW_AT_external    : 1
    <1080>   DW_AT_location    : 5 byte block: 3 ac 9 0 20 	(DW_OP_addr: 200009ac)
 <1><1086>: Abbrev Number: 25 (DW_TAG_variable)
    <1087>   DW_AT_name        : (indirect string, offset: 0x86c56): buton_esc_flag
    <108b>   DW_AT_decl_file   : 1
    <108c>   DW_AT_decl_line   : 96
    <108d>   DW_AT_decl_column : 5
    <108e>   DW_AT_type        : <0x2ff>
    <1092>   DW_AT_external    : 1
    <1092>   DW_AT_location    : 5 byte block: 3 b0 9 0 20 	(DW_OP_addr: 200009b0)
 <1><1098>: Abbrev Number: 25 (DW_TAG_variable)
    <1099>   DW_AT_name        : (indirect string, offset: 0x8613b): buton_set_flag
    <109d>   DW_AT_decl_file   : 1
    <109e>   DW_AT_decl_line   : 97
    <109f>   DW_AT_decl_column : 5
    <10a0>   DW_AT_type        : <0x2ff>
    <10a4>   DW_AT_external    : 1
    <10a4>   DW_AT_location    : 5 byte block: 3 b4 9 0 20 	(DW_OP_addr: 200009b4)
 <1><10aa>: Abbrev Number: 22 (DW_TAG_array_type)
    <10ab>   DW_AT_type        : <0xfb9>
    <10af>   DW_AT_sibling     : <0x10ba>
 <2><10b3>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <10b4>   DW_AT_type        : <0x306>
    <10b8>   DW_AT_upper_bound : 5
 <2><10b9>: Abbrev Number: 0
 <1><10ba>: Abbrev Number: 25 (DW_TAG_variable)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x863f6): main_menu
    <10bf>   DW_AT_decl_file   : 1
    <10c0>   DW_AT_decl_line   : 101
    <10c1>   DW_AT_decl_column : 6
    <10c2>   DW_AT_type        : <0x10aa>
    <10c6>   DW_AT_external    : 1
    <10c6>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><10cc>: Abbrev Number: 22 (DW_TAG_array_type)
    <10cd>   DW_AT_type        : <0xfb9>
    <10d1>   DW_AT_sibling     : <0x10dc>
 <2><10d5>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <10d6>   DW_AT_type        : <0x306>
    <10da>   DW_AT_upper_bound : 4
 <2><10db>: Abbrev Number: 0
 <1><10dc>: Abbrev Number: 25 (DW_TAG_variable)
    <10dd>   DW_AT_name        : (indirect string, offset: 0x85f05): device_menu
    <10e1>   DW_AT_decl_file   : 1
    <10e2>   DW_AT_decl_line   : 104
    <10e3>   DW_AT_decl_column : 6
    <10e4>   DW_AT_type        : <0x10cc>
    <10e8>   DW_AT_external    : 1
    <10e8>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><10ee>: Abbrev Number: 25 (DW_TAG_variable)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x86880): device_menu_address
